[
  "Close",
  "Copyright 2016 Mattermost, Inc. All rights reserved",
  "Database:",
  "Build Date:",
  "Learn more about Enterprise Edition at ",
  "Modern communication from behind your firewall.",
  "Enterprise Edition",
  "Build Hash:",
  "EE Build Hash:",
  "Licensed to:",
  "Build Number:",
  "Join the Mattermost community at ",
  "All your team communication in one place, instantly searchable and accessible anywhere.",
  "Team Edition",
  "Enterprise Edition",
  "About Mattermost",
  "Version:",
  "Access History",
  "Active Sessions",
  "Browser: {browser}",
  "First time active: {date}, {time}",
  "Last activity: {date}, {time}",
  "Logout",
  "More info",
  "OS: {os}",
  "Session ID: {id}",
  "Sessions are created when you log in to a new browser on a device. Sessions let you use Mattermost without having to log in again for a time period specified by the System Admin. If you want to log out sooner, use the 'Logout' button below to end a session.",
  "Android",
  "Android Native App",
  "iPhone Native App",
  "Autocomplete",
  "(Optional) Show slash command in autocomplete list.",
  "Autocomplete Description",
  "(Optional) Short description of slash command for the autocomplete list.",
  "Example: \"Returns search results for patient records\"",
  "Autocomplete Hint",
  "(Optional) Arguments associated with your slash command, displayed as help in the autocomplete list.",
  "Example: [Patient Name]",
  "Cancel",
  "Description",
  "Description for your incoming webhook.",
  "Display Name",
  "Display name for your slash command made of up to 64 characters.",
  "Your slash command has been set up. The following token will be sent in the outgoing payload. Please use it to verify the request came from your Mattermost team (see <a href=\"https://docs.mattermost.com/developer/slash-commands.html\">documentation</a> for further details).",
  "Response Icon",
  "(Optional) Choose a profile picture override for the post responses to this slash command. Enter the URL of a .png or .jpg file at least 128 pixels by 128 pixels.",
  "https://www.example.com/myicon.png",
  "Request Method",
  "GET",
  "The type of command request issued to the Request URL.",
  "POST",
  "Save",
  "<b>Token</b>: {token}",
  "Command Trigger Word",
  "Trigger word must be unique, and cannot begin with a slash or contain any spaces.",
  "Examples: client, employee, patient, weather",
  "Reserved: {link}",
  "see list of built-in slash commands",
  "Command trigger e.g. \"hello\"",
  "A trigger word must contain between {min} and {max} characters",
  "A trigger word cannot begin with a /",
  "A trigger word must not contain spaces",
  "A trigger word is required",
  "Request URL",
  "The callback URL to receive the HTTP POST or GET event request when the slash command is run.",
  "Must start with http:// or https://",
  "A request URL is required",
  "Response Username",
  "(Optional) Choose a username override for responses for this slash command. Usernames can consist of up to 22 characters consisting of lowercase letters, numbers and they symbols \"-\", \"_\", and \".\" .",
  "Username",
  "Cancel",
  "Add",
  "Image",
  "Select",
  "Choose the image for your emoji. The image can be a gif, png, or jpeg file with a max size of 64 KB and dimensions up to 128 by 128 pixels.",
  "An image is required for the emoji",
  "Name",
  "Choose a name for your emoji made of up to 64 characters consisting of lowercase letters, numbers, and the symbols '-' and '_'.",
  "An emoji's name can only contain numbers, letters, and the symbols '-' and '_'.",
  "A name is required for the emoji",
  "This name is already in use by a system emoji. Please choose another name.",
  "Preview",
  "This is a sentence with {image} in it.",
  "Save",
  "Cancel",
  "Channel",
  "Public channel or private group that receives the webhook payloads. You must belong to the private group when setting up the webhook.",
  "A valid channel is required",
  "Description",
  "Description for your incoming webhook.",
  "Display Name",
  "Display name for your incoming webhook made of up to 64 characters.",
  "Your incoming webhook has been set up. Please send data to the following URL (see <a href=\"https://docs.mattermost.com/developer/webhooks-incoming.html\">documentation</a> for further details).",
  "Name",
  "Save",
  "<b>URL</b>: {url}",
  "The redirect URIs to which the service will redirect users after accepting or denying authorization of your application, and which will handle authorization codes or access tokens. Must be a valid URL and start with http:// or https://.",
  "One or more callback URLs are required",
  "<b>Client ID</b>: {id}",
  "<b>Client Secret</b>: {secret}",
  "Description for your OAuth 2.0 application.",
  "Description for the OAuth 2.0 application is required.",
  "Your OAuth 2.0 application has been set up. Please use the following Client ID and Client Secret when requesting authorization for your application (see <a href=\"https://docs.mattermost.com/developer/oauth-2-0-applications.html\">documentation</a> for further details).",
  "The following are your authorized redirect URL(s).",
  "Add",
  "The URL for the homepage of the OAuth 2.0 application. Make sure you use HTTP or HTTPS in your URL depending on your server configuration.",
  "Homepage for the OAuth 2.0 application is required.",
  "(Optional) The URL of the image used for your OAuth 2.0 application. Make sure you use HTTP or HTTPS in your URL.",
  "Display name for your OAuth 2.0 application made of up to 64 characters.",
  "Name for the OAuth 2.0 application is required.",
  "When true, the OAuth 2.0 application is considered trusted by the Mattermost server and doesn't require the user to accept authorization. When false, an additional window will appear, asking the user to accept or deny the authorization.",
  "<b>URL(s)</b>: {url}",
  "Callback URLs (One Per Line)",
  "The URL that messages will be sent to.",
  "One or more callback URLs are required",
  "Cancel",
  "Channel",
  "Public channel to receive webhook payloads. Optional if at least one Trigger Word is specified.",
  "Choose the content type by which the response will be sent.",
  "If application/x-www-form-urlencoded is chosen, the server assumes you will be encoding the parameters in a URL format.",
  "If application/json is chosen, the server assumes you will posting JSON data.",
  "Content Type",
  "Description",
  "Description for your outgoing webhook.",
  "Display Name",
  "Display name for your outgoing webhook made of up to 64 characters.",
  "Your outgoing webhook has been set up. The following token will be sent in the outgoing payload. Please use it to verify the request came from your Mattermost team (see <a href=\"https://docs.mattermost.com/developer/webhooks-outgoing.html\">documentation</a> for further details).",
  "Name",
  "Save",
  "<b>Token</b>: {token}",
  "Trigger Words (One Per Line)",
  "Messages that start with one of the specified words will trigger the outgoing webhook. Optional if Channel is selected.",
  "A valid channel or a list of trigger words is required",
  "Trigger When",
  "Choose when to trigger the outgoing webhook; if the first word of a message matches a Trigger Word exactly, or if it starts with a Trigger Word.",
  "First word matches a trigger word exactly",
  "First word starts with a trigger word",
  "High Availability (Beta)",
  "Reload User Activity Logs",
  "User Activity Logs",
  "Email Auth",
  "GitLab",
  "AD/LDAP",
  "OAuth 2.0",
  "SAML",
  "Note:",
  "When true, Mattermost will run in High Availability mode. Please see <a href=\"http://docs.mattermost.com/deployment/cluster.html\" target=\"_blank\">documentation</a> to learn more about configuring High Availability for Mattermost.",
  "Enable High Availability Mode:",
  "The address the server will listen on for communicating with other servers.",
  "E.g.: \":8075\"",
  "Inter-Node Listen Address:",
  "The internal/private URLs of all the Mattermost servers separated by commas.",
  "E.g.: \"http://10.10.10.30, http://10.10.10.31\"",
  "Inter-Node URLs:",
  "This configuration file was loaded from Node ID {clusterId}. Please see the Troubleshooting Guide in our <a href=\"http://docs.mattermost.com/deployment/cluster.html\" target=\"_blank\">documentation</a> if you are accessing the System Console through a load balancer and experiencing issues.",
  "Changing properties in this section will require a server restart before taking effect. When High Availability mode is enabled, the System Console is set to read-only and can only be changed from the configuration file.",
  "WARNING: These settings may not sync with the other servers in the cluster. High Availability inter-node communication will not start until you modify the config.json to be identical on all servers and restart Mattermost. Please see the <a href=\"http://docs.mattermost.com/deployment/cluster.html\" target=\"_blank\">documentation</a> on how to add or remove a server from the cluster. If you are accessing the System Console through a load balancer and experiencing issues, please see the Troubleshooting Guide in our <a href=\"http://docs.mattermost.com/deployment/cluster.html\" target=\"_blank\">documentation</a>.",
  "Config File MD5",
  "Hostname",
  "Node ID",
  " Reload Cluster Status",
  "Status",
  "Inter-Node URL",
  "Version",
  "Directory to which compliance reports are written. If blank, will be set to ./data/.",
  "E.g.: \"./data/\"",
  "Compliance Report Directory:",
  "When true, Mattermost will generate a daily compliance report.",
  "Enable Daily Report:",
  "When true, Mattermost allows compliance reporting from the <strong>Compliance and Auditing</strong> tab. See <a href=\"https://docs.mattermost.com/administration/compliance.html\" target=\"_blank\">documentation</a> to learn more.",
  "Enable Compliance Reporting:",
  "false",
  "<h4 class=\"banner__heading\">Note:</h4><p>Compliance is an enterprise feature. Your current license does not support Compliance. Click <a href=\"http://mattermost.com\" target=\"_blank\">here</a> for information and pricing on enterprise licenses.</p>",
  "Save",
  "Saving Config...",
  "Compliance Settings",
  "true",
  "Job Name:",
  "E.g. \"Audit 445 for HR\"",
  "Emails:",
  "E.g. \"bill@example.com, bob@example.com\"",
  "From:",
  "E.g. \"2016-03-11\"",
  "Keywords:",
  "E.g. \"shorting stock\"",
  "Reload Completed Compliance Reports",
  "Run Compliance Report",
  "Compliance Reports",
  "To:",
  "E.g. \"2016-03-15\"",
  "Description",
  "Download",
  "Params",
  "Records",
  "Status",
  "Timestamp",
  "Type",
  "Requested By",
  "None",
  "Mattermost will connect over an unsecure connection.",
  "PLAIN",
  "Mattermost will connect and authenticate over an unsecure connection.",
  "STARTTLS",
  "Takes an existing insecure connection and attempts to upgrade it to a secure connection using TLS.",
  "Test Connection",
  "Connection Security:",
  "TLS",
  "Encrypts the communication between Mattermost and your server.",
  "Add a link to download the Android app. Users who access the site on a mobile web browser will be prompted with a page giving them the option to download the app. Leave this field blank to prevent the page from appearing.",
  "Android App Download Link:",
  "Add a link to a download page for the Mattermost apps. When a link is present, an option to \"Download Mattermost Apps\" will be added in the Main Menu so users can find the download page. Leave this field blank to hide the option from the Main Menu.",
  "Mattermost Apps Download Page Link:",
  "Custom Branding",
  "Custom Emoji",
  "Enable users to create custom emoji for use in messages. When enabled, Custom Emoji settings can be accessed by switching to a team and clicking the three dots above the channel sidebar, and selecting \"Custom Emoji\".",
  "Enable Custom Emoji:",
  "Add a link to download the iOS app. Users who access the site on a mobile web browser will be prompted with a page giving them the option to download the app. Leave this field blank to prevent the page from appearing.",
  "iOS App Download Link:",
  "Mattermost App Links",
  "Allow System and Team Admins to create custom emoji",
  "Allow everyone to create custom emoji",
  "Restrict the creation of custom emoji to certain users.",
  "Only allow System Admins to create custom emoji",
  "Restrict Custom Emoji Creation:",
  "Legal and Support",
  "Database Settings",
  "Developer Settings",
  " I understand and accept the Mattermost Hosted Push Notification Service <a href=\"https://about.mattermost.com/hpns-terms/\" target=\"_blank\">Terms of Service</a> and <a href=\"https://about.mattermost.com/hpns-privacy/\" target=\"_blank\">Privacy Policy</a>.",
  "When true, Mattermost allows users to sign in using their email and password.",
  "Enable sign-in with email: ",
  "When true, Mattermost allows team creation and account signup using email and password.  This value should be false only when you want to limit signup to a single-sign-on service like OAuth or AD/LDAP.",
  "Enable account creation with email: ",
  "When true, Mattermost allows users to sign in using their username and password.  This setting is typically only used when email verification is disabled.",
  "Enable sign-in with username: ",
  "Test Connection",
  "Learn more about compiling and deploying your own mobile apps from an <a href=\"http://docs.mattermost.com/deployment/push.html#enterprise-app-store-eas\" target=\"_blank\">Enterprise App Store</a>.",
  "Connection unsuccessful: {error}",
  "No errors were reported while sending an email.  Please check your inbox to make sure.",
  "Email batching cannot be enabled when High Availability mode is enabled.",
  "Email batching cannot be enabled unless the SiteURL is configured in <b>Configuration > SiteURL</b>.",
  "When true, users can have email notifications for multiple direct messages and mentions combined into a single email, configurable in <b>Account Settings > Notifications</b>.",
  "Enable Email Batching:",
  "Send full message snippet",
  "Send generic description with user and channel names",
  "32-character salt added to signing of email invites. Randomly generated on install. Click \"Regenerate\" to create new salt.",
  "E.g.: \"bjlSR4QqkXFBr7TP4oDzlfZmcNuH9Yo\"",
  "Email Invite Salt:",
  "Use encrypted, production-quality HPNS connection to iOS and Android apps",
  "Download <a href=\"https://itunes.apple.com/us/app/mattermost/id984966508?mt=8\" target=\"_blank\">Mattermost iOS app</a> from iTunes. Download <a href=\"https://play.google.com/store/apps/details?id=com.mattermost.mattermost&hl=en\" target=\"_blank\">Mattermost Android app</a> from Google Play. Learn more about <a href=\"http://docs.mattermost.com/deployment/push.html#hosted-push-notifications-service-hpns\" target=\"_blank\">HPNS</a>.",
  "Use iOS and Android apps on iTunes and Google Play with TPNS",
  "Download <a href=\"https://itunes.apple.com/us/app/mattermost/id984966508?mt=8\" target=\"_blank\">Mattermost iOS app</a> from iTunes. Download <a href=\"https://play.google.com/store/apps/details?id=com.mattermost.mattermost&hl=en\" target=\"_blank\">Mattermost Android app</a> from Google Play. Learn more about <a href=\"http://docs.mattermost.com/deployment/push.html#test-push-notifications-service-tpns\" target=\"_blank\">TPNS</a>.",
  "Ex. \"© ABC Corporation, 565 Knight Way, Palo Alto, California, 94305, USA\"",
  "Display name on email account used when sending notification emails from Mattermost.",
  "Ex: \"Mattermost Notification\", \"System\", \"No-Reply\"",
  "Notification Display Name:",
  "Email address displayed on email account used when sending notification emails from Mattermost.",
  "Ex: \"mattermost@yourcompany.com\", \"admin@yourcompany.com\"",
  "Notification From Address:",
  "Notification Footer Mailing Address:",
  "Organization name and address displayed on email notifications from Mattermost, such as \"© ABC Corporation, 565 Knight Way, Palo Alto, California, 94305, USA\". If the field is left empty, the organization name and address will not be displayed.",
  "Typically set to true in production. When true, Mattermost attempts to send email notifications. Developers may set this field to false to skip email setup for faster development.<br />Setting this to true removes the Preview Mode banner (requires logging out and logging back in after setting is changed).",
  "Enable Email Notifications: ",
  "32-character salt added to signing of password reset emails. Randomly generated on install. Click \"Regenerate\" to create new salt.",
  "E.g.: \"bjlSR4QqkXFBr7TP4oDzlfZmcNuH9Yo\"",
  "Password Reset Salt:",
  "Selecting \"Send generic description with user and channel names\" provides push notifications with generic messages, including names of users and channels but no specific details from the message text.<br /><br />Selecting \"Send full message snippet\" sends excerpts from messages triggering notifications with specifics and may include confidential information sent in messages. If your Push Notification Service is outside your firewall, it is HIGHLY RECOMMENDED this option only be used with an \"https\" protocol to encrypt the connection.",
  "Push Notification Contents:",
  "Typically set to true in production. When true, Mattermost attempts to send iOS and Android push notifications through the push notification server.",
  "Do not send push notifications",
  "Please see <a href=\"http://docs.mattermost.com/deployment/push.html#push-notifications-and-mobile-devices\" target=\"_blank\">documentation on push notifications</a> to learn more about setup options.",
  "Location of Mattermost push notification service you can set up behind your firewall using https://github.com/mattermost/push-proxy. For testing you can use http://push-test.mattermost.com, which connects to the sample Mattermost iOS app in the public Apple AppStore. Please do not use test service for production deployments.",
  "E.g.: \"http://push-test.mattermost.com\"",
  "Push Notification Server:",
  "Enable Push Notifications: ",
  "Typically set to true in production. When true, Mattermost requires email verification after account creation prior to allowing login. Developers may set this field to false so skip sending verification emails for faster development.",
  "Require Email Verification: ",
  "Manually enter Push Notification Service location",
  " Obtain this credential from administrator setting up your email server.",
  "Ex: \"yourpassword\", \"jcuS8PuvcpGhpgHhlcpT1Mx42pnqMxQY\"",
  "SMTP Server Password:",
  "Port of SMTP email server.",
  "Ex: \"25\", \"465\"",
  "SMTP Server Port:",
  "Location of SMTP email server.",
  "Ex: \"smtp.yourcompany.com\", \"email-smtp.us-east-1.amazonaws.com\"",
  "SMTP Server:",
  " Obtain this credential from administrator setting up your email server.",
  "Ex: \"admin@yourcompany.com\", \"AKIADTOVBGERKLCBV\"",
  "SMTP Server Username:",
  "Testing...",
  "false",
  "Choose File",
  "No file uploaded",
  "Upload",
  "Images",
  "Storage",
  "Configuration",
  "Localization",
  "Set which languages are available for users in Account Settings (leave this field blank to have all supported languages available). If you’re manually adding new languages, the <strong>Default Client Language</strong> must be added before saving this setting.<br /><br />Would like to help with translations? Join the <a href='http://translate.mattermost.com/' target='_blank'>Mattermost Translation Server</a> to contribute.",
  "Available Languages:",
  "Default language for newly created users and pages where the user hasn't logged in.",
  "Default Client Language:",
  "Default language for system messages and logs. Changing this will require a server restart before taking effect.",
  "Default Server Language:",
  "Logging",
  "Policy",
  "Team and System Admins",
  "All team members",
  "System Admins",
  "Set policy on who can create, delete, rename, and set the header or purpose for private groups.",
  "Enable private group management permissions for:",
  "Set policy on who can create, delete, rename, and set the header or purpose for public channels.",
  "Enable public channel management permissions for:",
  "Set policy on who can invite others to a team using <b>Invite New Member</b> to invite new users by email, or the <b>Get Team Invite Link</b> options from the Main Menu. If <b>Get Team Invite Link</b> is used to share a link, you can expire the invite code from <b>Team Settings</b> > <b>Invite Code</b> after the desired users join the team.",
  "Enable sending team invites from:",
  "Privacy",
  "Users and Teams",
  "Obtain this value via the instructions above for logging into GitLab.",
  "<ol><li>Log in to your GitLab account and go to Profile Settings -> Applications.</li><li>Enter Redirect URIs \"<your-mattermost-url>/login/gitlab/complete\" (example: http://localhost:8065/login/gitlab/complete) and \"<your-mattermost-url>/signup/gitlab/complete\". </li><li>Then use \"Application Secret Key\" and \"Application ID\" fields from GitLab to complete the options below.</li><li>Complete the Endpoint URLs below. </li></ol>",
  "Enter https://<your-gitlab-url>/oauth/authorize (example https://example.com:3000/oauth/authorize).   Make sure you use HTTP or HTTPS in your URL depending on your server configuration.",
  "E.g.: \"https://<your-gitlab-url>/oauth/authorize\"",
  "Auth Endpoint:",
  "Obtain this value via the instructions above for logging into GitLab",
  "E.g.: \"jcuS8PuvcpGhpgHhlcpT1Mx42pnqMxQY\"",
  "Application ID:",
  "E.g.: \"jcuS8PuvcpGhpgHhlcpT1Mx42pnqMxQY\"",
  "Application Secret Key:",
  "When true, Mattermost allows team creation and account signup using GitLab OAuth.",
  "Enable authentication with GitLab: ",
  "GitLab Settings",
  "Enter https://<your-gitlab-url>/oauth/token.   Make sure you use HTTP or HTTPS in your URL depending on your server configuration.",
  "E.g.: \"https://<your-gitlab-url>/oauth/token\"",
  "Token Endpoint:",
  "Enter https://<your-gitlab-url>/api/v3/user.   Make sure you use HTTP or HTTPS in your URL depending on your server configuration.",
  "E.g.: \"https://<your-gitlab-url>/api/v3/user\"",
  "User API Endpoint:",
  "<ol><li><a href='https://accounts.google.com/login'>Log in</a> to your Google account.</li><li>Go to <a href='https://console.developers.google.com'>https://console.developers.google.com</a>, click <strong>Credentials</strong> in the left hand sidebar and enter \"Mattermost - your-company-name\" as the <strong>Project Name</strong>, then click <strong>Create</strong>.</li><li>Click the <strong>OAuth consent screen</strong> header and enter \"Mattermost\" as the <strong>Product name shown to users</strong>, then click <strong>Save</strong>.</li><li>Under the <strong>Credentials</strong> header, click <strong>Create credentials</strong>, choose <strong>OAuth client ID</strong> and select <strong>Web Application</strong>.</li><li>Under <strong>Restrictions</strong> and <strong>Authorized redirect URIs</strong> enter <strong>your-mattermost-url/signup/google/complete</strong> (example: http://localhost:8065/signup/google/complete). Click <strong>Create</strong>.</li><li>Paste the <strong>Client ID</strong> and <strong>Client Secret</strong> to the fields below, then click <strong>Save</strong>.</li><li>Finally, go to <a href='https://console.developers.google.com/apis/api/plus/overview'>Google+ API</a> and click <strong>Enable</strong>. This might take a few minutes to propagate through Google's systems.</li></ol>",
  "Auth Endpoint:",
  "The Client ID you received when registering your application with Google.",
  "E.g.: \"7602141235235-url0fhs1mayfasbmop5qlfns8dh4.apps.googleusercontent.com\"",
  "Client ID:",
  "The Client Secret you received when registering your application with Google.",
  "E.g.: \"H8sz0Az-dDs2p15-7QzD231\"",
  "Client Secret:",
  "Token Endpoint:",
  "User API Endpoint:",
  "Name you selected for your S3 bucket in AWS.",
  "E.g.: \"mattermost-media\"",
  "Amazon S3 Bucket:",
  "Obtain this credential from your Amazon EC2 administrator.",
  "E.g.: \"AKIADTOVBGERKLCBV\"",
  "Amazon S3 Access Key ID:",
  "AWS region you selected for creating your S3 bucket.",
  "E.g.: \"us-east-1\"",
  "Amazon S3 Region:",
  "Obtain this credential from your Amazon EC2 administrator.",
  "E.g.: \"jcuS8PuvcpGhpgHhlcpT1Mx42pnqMxQY\"",
  "Amazon S3 Secret Access Key:",
  "Directory to which files and images are written. If blank, defaults to ./data/.",
  "E.g.: \"./data/\"",
  "Local Storage Directory:",
  "Maximum file size for message attachments in megabytes. Caution: Verify server memory can support your setting choice. Large file sizes increase the risk of server crashes and failed uploads due to network interruptions.",
  "50",
  "Maximum File Size:",
  "Maximum height of preview image (\"0\": Sets to auto-size). Updating this value changes how preview images render in future, but does not change images created in the past.",
  "E.g.: \"0\"",
  "Image Preview Height:",
  "Maximum width of preview image. Updating this value changes how preview images render in future, but does not change images created in the past.",
  "E.g.: \"1024\"",
  "Image Preview Width:",
  "Height of profile picture.",
  "E.g.: \"0\"",
  "Profile Picture Height:",
  "Width of profile picture.",
  "E.g.: \"1024\"",
  "Profile Picture Width:",
  "32-character salt added to signing of public image links. Randomly generated on install. Click \"Regenerate\" to create new salt.",
  "E.g.: \"gxHVDcKUyP2y1eiyW8S8na1UYQAfq6J6\"",
  "Public Link Salt:",
  "Allow users to share public links to files and images.",
  "Enable Public File Links: ",
  "Amazon S3",
  "Storage system where files and image attachments are saved.<br /><br />Selecting \"Amazon S3\" enables fields to enter your Amazon credentials and bucket details.<br /><br />Selecting \"Local File System\" enables the field to specify a local file directory.",
  "Local File System",
  "File Storage System:",
  "Height of thumbnails generated from uploaded images. Updating this value changes how thumbnail images render in future, but does not change images created in the past.",
  "E.g.: \"100\"",
  "Attachment Thumbnail Height:",
  "Width of thumbnails generated from uploaded images. Updating this value changes how thumbnail images render in future, but does not change images created in the past.",
  "E.g.: \"120\"",
  "Attachment Thumbnail Width:",
  "Custom Integrations",
  "External Services",
  "Mattermost WebRTC",
  "The Base DN is the Distinguished Name of the location where Mattermost should start its search for users in the AD/LDAP tree.",
  "E.g.: \"ou=Unit Name,dc=corp,dc=example,dc=com\"",
  "BaseDN:",
  "Password of the user given in \"Bind Username\".",
  "Bind Password:",
  "The username used to perform the AD/LDAP search. This should typically be an account created specifically for use with Mattermost. It should have access limited to read the portion of the AD/LDAP tree specified in the BaseDN field.",
  "Bind Username:",
  "The attribute in the AD/LDAP server that will be used to populate the email addresses of users in Mattermost.",
  "E.g.: \"mail\" or \"userPrincipalName\"",
  "Email Attribute:",
  "When true, Mattermost allows login using AD/LDAP",
  "Enable sign-in with AD/LDAP:",
  "(Optional) The attribute in the AD/LDAP server that will be used to populate the first name of users in Mattermost. When set, users will not be able to edit their first name, since it is synchronized with the LDAP server. When left blank, users can set their own first name in Account Settings.",
  "E.g.: \"givenName\"",
  "First Name Attribute",
  "The attribute in the AD/LDAP server that will be used as a unique identifier in Mattermost. It should be an AD/LDAP attribute with a value that does not change, such as username or uid. If a user’s ID Attribute changes, it will create a new Mattermost account unassociated with their old one. This is the value used to log in to Mattermost in the \"AD/LDAP Username\" field on the sign in page. Normally this attribute is the same as the “Username Attribute” field above. If your team typically uses domain\\username to sign in to other services with AD/LDAP, you may choose to put domain\\username in this field to maintain consistency between sites.",
  "E.g.: \"sAMAccountName\"",
  "ID Attribute: ",
  "(Optional) The attribute in the AD/LDAP server that will be used to populate the last name of users in Mattermost. When set, users will not be able to edit their last name, since it is synchronized with the LDAP server. When left blank, users can set their own last name in Account Settings.",
  "E.g.: \"sn\"",
  "Last Name Attribute:",
  "AD/LDAP Test",
  "The placeholder text that appears in the login field on the login page. Defaults to \"AD/LDAP Username\".",
  "E.g.: \"AD/LDAP Username\"",
  "Login Field Name:",
  "E.g.: \"2000\"",
  "The maximum number of users the Mattermost server will request from the AD/LDAP server at one time. 0 is unlimited.",
  "Maximum Page Size:",
  "(Optional) The attribute in the AD/LDAP server that will be used to populate the nickname of users in Mattermost. When set, users will not be able to edit their nickname, since it is synchronized with the LDAP server. When left blank, users can set their own nickname in Account Settings.",
  "E.g.: \"nickname\"",
  "Nickname Attribute:",
  "<h4 class=\"banner__heading\">Note:</h4><p>AD/LDAP is an enterprise feature. Your current license does not support AD/LDAP. Click <a href=\"http://mattermost.com\" target=\"_blank\">here</a> for information and pricing on enterprise licenses.</p>",
  "The port Mattermost will use to connect to the AD/LDAP server. Default is 389.",
  "E.g.: \"389\"",
  "AD/LDAP Port:",
  "The timeout value for queries to the AD/LDAP server. Increase if you are getting timeout errors caused by a slow AD/LDAP server.",
  "E.g.: \"60\"",
  "Query Timeout (seconds):",
  "The domain or IP address of AD/LDAP server.",
  "E.g.: \"10.0.0.23\"",
  "AD/LDAP Server:",
  "Skip Certificate Verification:",
  "Skips the certificate verification step for TLS or STARTTLS connections. Not recommended for production environments where TLS is required. For testing only.",
  "Sync Failure: {error}",
  "AD/LDAP Synchronization updates Mattermost user information to reflect updates on the AD/LDAP server. For example, when a user’s name changes on the AD/LDAP server, the change updates in Mattermost when synchronization is performed. Accounts removed from or disabled in the AD/LDAP server have their Mattermost accounts set to “Inactive” and have their account sessions revoked. Mattermost performs synchronization on the interval entered. For example, if 60 is entered, Mattermost synchronizes every 60 minutes.",
  "Synchronization Interval (minutes):",
  "Initiates an AD/LDAP synchronization immediately.",
  "AD/LDAP Synchronize Now",
  "AD/LDAP Test Failure: {error}",
  "Tests if the Mattermost server can connect to the AD/LDAP server specified. See log file for more detailed error messages.",
  "AD/LDAP Test Successful",
  "The attribute in the AD/LDAP server that will be used to populate the username field in Mattermost. This may be the same as the ID Attribute.",
  "(Optional) Enter an AD/LDAP Filter to use when searching for user objects. Only the users selected by the query will be able to access Mattermost. For Active Directory, the query to filter out disabled users is (&(objectCategory=Person)(!(UserAccountControl:1.2.840.113556.1.4.803:=2))).",
  "Ex. \"(objectClass=user)\"",
  "User Filter:",
  "E.g.: \"sAMAccountName\"",
  "Username Attribute:",
  "Choose File",
  "Choose File",
  "Edition: ",
  "License Key: ",
  "Remove Enterprise License and Downgrade Server",
  "No file uploaded",
  "Removing License...",
  "Edition and License",
  "License: ",
  "Upload",
  "Upload a license key for Mattermost Enterprise Edition to upgrade this server. <a href=\"http://mattermost.com\" target=\"_blank\">Visit us online</a> to learn more about the benefits of Enterprise Edition or to purchase a key.",
  "Uploading License...",
  "Typically set to false in production. Developers may set this field to true to output log messages to console based on the console level option.  If true, server writes messages to the standard output stream (stdout).",
  "Output logs to console: ",
  "Enable Diagnostics and Error Reporting:",
  "Enable this feature to improve the quality and performance of Mattermost by sending error reporting and diagnostic information to Mattermost, Inc. Read our <a href=\"https://about.mattermost.com/default-privacy-policy/\" target=\"_blank\">privacy policy</a> to learn more.",
  "Enable Webhook Debugging:",
  "You can set this to false to disable the debug logging of all incoming webhook request bodies.",
  "Typically set to true in production.  When true, log files are written to the log file specified in file location field below.",
  "This setting determines the level of detail at which log events are written to the log file. ERROR: Outputs only error messages. INFO: Outputs error messages and information around startup and initialization. DEBUG: Prints high detail for developers working on debugging issues.",
  "File Log Level:",
  "Output logs to file: ",
  "Date (2006/01/02)",
  "Date (01/02/06)",
  "Format of log message output. If blank will be set to \"[%D %T] [%L] %M\", where:",
  "Level (DEBG, INFO, EROR)",
  "Message",
  "Enter your file format",
  "Source",
  "Time (15:04:05 MST)",
  "File Log Format:",
  "This setting determines the level of detail at which log events are written to the console. ERROR: Outputs only error messages. INFO: Outputs error messages and information around startup and initialization. DEBUG: Prints high detail for developers working on debugging issues.",
  "Console Log Level:",
  "File to which log files are written. If blank, will be set to ./logs/mattermost, which writes logs to mattermost.log. Log rotation is enabled and every 10,000 lines of log information is written to new files stored in the same directory, for example mattermost.2015-09-23.001, mattermost.2015-09-23.002, and so forth.",
  "Enter your file location",
  "File Log Directory:",
  "Log Settings",
  "Reload",
  "Server Logs",
  "Help",
  "Logout",
  "Report a Problem",
  "Team Selection",
  "Email",
  "Mobile Push",
  "Notification Settings",
  "GitLab",
  "Google Apps",
  "Do not allow sign-in via an OAuth 2.0 provider",
  "Office 365 (Beta)",
  "When true, Mattermost can act as an OAuth 2.0 service provider allowing Mattermost to authorize API requests from external applications. See <a href=\"https://docs.mattermost.com/developer/oauth-2-0-applications.html\">documentation</a> to learn more.",
  "Enable OAuth 2.0 Service Provider: ",
  "Select OAuth 2.0 service provider:",
  "<ol><li><a href='https://login.microsoftonline.com/'>Log in</a> to your Microsoft or Office 365 account. Make sure it's the account on the same <a href='https://msdn.microsoft.com/en-us/library/azure/jj573650.aspx#Anchor_0'>tenant</a> that you would like users to log in with.</li><li>Go to <a href='https://apps.dev.microsoft.com'>https://apps.dev.microsoft.com</a>, click <strong>Go to app list</strong> > <strong>Add an app</strong> and use \"Mattermost - your-company-name\" as the <strong>Application Name</strong>.</li><li>Under <strong>Application Secrets</strong>, click <strong>Generate New Password</strong> and paste it to the <strong>Application Secret Password</strong> field below.</li><li>Under <strong>Platforms</strong>, click <strong>Add Platform</strong>, choose <strong>Web</strong> and enter <strong>your-mattermost-url/signup/office365/complete</strong> (example: http://localhost:8065/signup/office365/complete) under <strong>Redirect URIs</strong>. Also uncheck <strong>Allow Implicit Flow</strong>.</li><li>Finally, click <strong>Save</strong> and then paste the <strong>Application ID</strong> below.</li></ol>",
  "Auth Endpoint:",
  "The Application/Client ID you received when registering your application with Microsoft.",
  "E.g.: \"adf3sfa2-ag3f-sn4n-ids0-sh1hdax192qq\"",
  "Application ID:",
  "The Application Secret Password you generated when registering your application with Microsoft.",
  "E.g.: \"shAieM47sNBfgl20f8ci294\"",
  "Application Secret Password:",
  "Token Endpoint:",
  "User API Endpoint:",
  "At least one lowercase letter",
  "Minimum Password Length:",
  "Minimum number of characters required for a valid password. Must be a whole number greater than or equal to {min} and less than or equal to {max}.",
  "E.g.: \"5\"",
  "At least one number",
  "Error message preview",
  "Password Requirements:",
  "Character types required in a valid password.",
  "At least one symbol (e.g. \"~!@#$%^&*()\")",
  "At least one uppercase letter",
  "When false, hides email address of users from other users in the user interface, including team owners and Team Administrators. Used when system is set up for managing teams where some users choose to keep their contact information private.",
  "Show Email Address: ",
  "When false, hides full name of users from other users, including team owners and Team Administrators. Username is shown in place of full name.",
  "Show Full Name: ",
  "When true, APIs are throttled at rates specified below.",
  "Enable Rate Limiting: ",
  "When filled in, vary rate limiting by HTTP header field specified (e.g. when configuring NGINX set to \"X-Real-IP\", when configuring AmazonELB set to \"X-Forwarded-For\").",
  "E.g.: \"X-Real-IP\", \"X-Forwarded-For\"",
  "Vary rate limit by HTTP header",
  "Maximum Burst Size:",
  "Maximum number of requests allowed beyond the per second query limit.",
  "E.g.: \"100\"",
  "Maximum number of users sessions connected to the system as determined by \"Vary rate limit by remote address\" and \"Vary rate limit by HTTP header\" settings below.",
  "E.g.: \"10000\"",
  "Memory Store Size:",
  "Changing properties in this section will require a server restart before taking effect.",
  "Note:",
  "Throttles API at this number of requests per second.",
  "E.g.: \"10\"",
  "Maximum Queries per Second:",
  "When true, rate limit API access by IP address.",
  "Vary rate limit by remote address: ",
  "Rate Limit Settings",
  "Recycle Database Connections",
  " Recycling...",
  "Deployments using multiple databases can switch from one master database to another without restarting the Mattermost server by updating \"config.json\" to the new desired configuration and using the <a href=\"../general/configuration\"><b>Configuration > Reload Configuration from Disk</b></a> feature to load the new settings while the server is running. The administrator should then use <b>Recycle Database Connections</b> feature to recycle the database connections based on the new settings.",
  "Recycling unsuccessful: {error}",
  "Regenerate",
  "Reload Configuration From Disk",
  " Loading...",
  "Deployments using multiple databases can switch from one master database to another without restarting the Mattermost server by updating \"config.json\" to the new desired configuration and using the <b>Reload Configuration from Disk</b> feature to load the new settings while the server is running. The administrator should then use the <a href=\"../advanced/database\"><b>Database > Recycle Database Connections</b></a> feature to recycle the database connections based on the new settings.",
  "Reloading unsuccessful: {error}",
  "Close",
  "New Password",
  "Select",
  "Please enter at least {chars} characters.",
  "Reset Password",
  "Switch Account to Email/Password",
  "Enter https://<your-mattermost-url>/login/sso/saml. Make sure you use HTTP or HTTPS in your URL depending on your server configuration. This field is also known as the Assertion Consumer Service URL.",
  "E.g.: \"https://<your-mattermost-url>/login/sso/saml\"",
  "Service Provider Login URL:",
  "If a user attribute changes on the SAML server it will be updated the next time the user enters their credentials to log in to Mattermost. This includes if a user is made inactive or removed from a SAML Identity Provider. Remote logout with SAML servers is considered in a future release.",
  "The attribute in the SAML Assertion that will be used to populate the email addresses of users in Mattermost.",
  "E.g.: \"Email\" or \"PrimaryEmail\"",
  "Email Attribute:",
  "When true, Mattermost allows login using SAML. Please see <a href='http://docs.mattermost.com/deployment/sso-saml.html' target='_blank'>documentation</a> to learn more about configuring SAML for Mattermost.",
  "Enable Login With SAML:",
  "When true, Mattermost will decrypt SAML Assertions encrypted with your Service Provider Public Certificate.",
  "Enable Encryption:",
  "(Optional) The attribute in the SAML Assertion that will be used to populate the first name of users in Mattermost.",
  "E.g.: \"FirstName\"",
  "First Name Attribute:",
  "The public authentication certificate issued by your Identity Provider.",
  "Remove the public authentication certificate issued by your Identity Provider.",
  "Identity Provider Public Certificate:",
  "The issuer URL for the Identity Provider you use for SAML requests.",
  "E.g.: \"https://idp.example.org/SAML2/issuer\"",
  "Identity Provider Issuer URL:",
  "The URL where Mattermost sends a SAML request to start login sequence.",
  "E.g.: \"https://idp.example.org/SAML2/SSO/Login\"",
  "SAML SSO URL:",
  "(Optional) The attribute in the SAML Assertion that will be used to populate the last name of users in Mattermost.",
  "E.g.: \"LastName\"",
  "Last Name Attribute:",
  "(Optional) The attribute in the SAML Assertion that will be used to populate the language of users in Mattermost.",
  "E.g.: \"Locale\" or \"PrimaryLanguage\"",
  "Preferred Language Attribute:",
  "(Optional) The text that appears in the login button on the login page. Defaults to \"With SAML\".",
  "E.g.: \"With OKTA\"",
  "Login Button Text:",
  "(Optional) The attribute in the SAML Assertion that will be used to populate the nickname of users in Mattermost.",
  "E.g.: \"Nickname\"",
  "Nickname Attribute:",
  "The private key used to decrypt SAML Assertions from the Identity Provider.",
  "Remove the private key used to decrypt SAML Assertions from the Identity Provider.",
  "Service Provider Private Key:",
  "The certificate used to generate the signature on a SAML request to the Identity Provider for a service provider initiated SAML login, when Mattermost is the Service Provider.",
  "Remove the certificate used to generate the signature on a SAML request to the Identity Provider for a service provider initiated SAML login, when Mattermost is the Service Provider.",
  "Service Provider Public Certificate:",
  "Remove Identity Provider Certificate",
  "Remove Service Provider Private Key",
  "Remove Service Provider Certificate",
  "Removing Certificate...",
  "Removing Private Key...",
  "Uploading Certificate...",
  "Uploading Private Key...",
  "The attribute in the SAML Assertion that will be used to populate the username field in Mattermost.",
  "E.g.: \"Username\"",
  "Username Attribute:",
  "When true, Mattermost verifies that the signature sent from the SAML Response matches the Service Provider Login URL",
  "Verify Signature:",
  "Save",
  "Saving Config...",
  "Connections",
  "Invite salt cannot be changed while sending emails is disabled.",
  "Login",
  "Password",
  "Password reset salt cannot be changed while sending emails is disabled.",
  "Public Links",
  "Email verification cannot be changed while sending emails is disabled.",
  "Sessions",
  "Signup",
  "Close",
  "Select",
  "Select Team",
  "Number of login attempts allowed before a user is locked out and required to reset their password via email.",
  "E.g.: \"10\"",
  "Maximum Login Attempts:",
  "When true, custom slash commands will be allowed. See <a href='http://docs.mattermost.com/developer/slash-commands.html' target='_blank'>documentation</a> to learn more.",
  "Enable Custom Slash Commands: ",
  "Enable HTTP Cross origin request from a specific domain. Use \"*\" if you want to allow CORS from any domain or leave it blank to disable it.",
  "http://example.com",
  "Enable cross-origin requests from:",
  "When true, Javascript errors are shown in a red bar at the top of the user interface. Not recommended for use in production. ",
  "Enable Developer Mode: ",
  "Set this key to enable the display of titles for embedded YouTube video previews. Without the key, YouTube previews will still be created based on hyperlinks appearing in messages or comments but they will not show the video title. View a <a href=\"https://www.youtube.com/watch?v=Im69kzhpR3I\" target=\"_blank\">Google Developers Tutorial</a> for instructions on how to obtain a key.",
  "E.g.: \"7rAh6iwQCkV4cA1Gsg3fgGOXJAQ43QV\"",
  "Google API Key:",
  "When true, webhooks, slash commands and other integrations, such as <a href=\"https://docs.mattermost.com/integrations/zapier.html\" target=\"_blank\">Zapier</a>, will be allowed to change the profile picture they post with. Note: Combined with allowing integrations to override usernames, users may be able to perform phishing attacks by attempting to impersonate other users.",
  "Enable integrations to override profile picture icons:",
  "When true, any outgoing HTTPS requests will accept unverified, self-signed certificates. For example, outgoing webhooks to a server with a self-signed TLS certificate, using any domain, will be allowed. Note that this makes these connections susceptible to man-in-the-middle attacks.",
  "Enable Insecure Outgoing Connections: ",
  "Restrict managing integrations to Admins:",
  "When true, webhooks and slash commands can only be created, edited and viewed by Team and System Admins, and OAuth 2.0 applications by System Admins. Integrations are available to all users after they have been created by the Admin.",
  "Listen Address:",
  "The address and port to which to bind and listen. Specifying \":8065\" will bind to all network interfaces. Specifying \"127.0.0.1:8065\" will only bind to the network interface having that IP address. If you choose a port of a lower level (called \"system ports\" or \"well-known ports\", in the range of 0-1023), you must have permissions to bind to that port. On Linux you can use: \"sudo setcap cap_net_bind_service=+ep ./bin/platform\" to allow Mattermost to bind to well-known ports.",
  "E.g.: \":8065\"",
  "When true, users will be given the option to add multi-factor authentication to their account. They will need a smartphone and an authenticator app such as Google Authenticator.",
  "Enable Multi-factor Authentication:",
  "Session length mobile (days):",
  "The number of days from the last time a user entered their credentials to the expiry of the user's session. After changing this setting, the new session length will take effect after the next time the user enters their credentials.",
  "When true, outgoing webhooks will be allowed. See <a href='http://docs.mattermost.com/developer/webhooks-outgoing.html' target='_blank'>documentation</a> to learn more.",
  "Enable Outgoing Webhooks: ",
  "When true, webhooks, slash commands and other integrations, such as <a href=\"https://docs.mattermost.com/integrations/zapier.html\" target=\"_blank\">Zapier</a>, will be allowed to change the username they are posting as. Note: Combined with allowing integrations to override profile picture icons, users may be able to perform phishing attacks by attempting to impersonate other users.",
  "Enable integrations to override usernames:",
  "When true, System Administrators are notified by email if a relevant security fix alert has been announced in the last 12 hours. Requires email to be enabled.",
  "Enable Security Alerts: ",
  "Segment.com is an online service that can be optionally used to track detailed system statistics. You can obtain a key by signing-up for a free account at Segment.com.",
  "E.g.: \"g3fgGOXJAQ43QV7rAh6iwQCkV4cA1Gs\"",
  "Segment Write Key:",
  "Session Cache (minutes):",
  "The number of minutes to cache a session in memory.",
  "E.g.: \"30\"",
  "Site URL:",
  "The URL, including port number and protocol, that users will use to access Mattermost. This field can be left blank unless you are configuring email batching in <b>Notifications > Email</b>. When blank, the URL is automatically configured based on incoming traffic.",
  "E.g.: \"https://mattermost.example.com:1234\"",
  "Session length SSO (days):",
  "The number of days from the last time a user entered their credentials to the expiry of the user's session. If the authentication method is SAML or GitLab, the user may automatically be logged back in to Mattermost if they are already logged in to SAML or GitLab. After changing this setting, the setting will take effect after the next time the user enters their credentials.",
  "When true, /loadtest slash command is enabled to load test accounts, data and text formatting. Changing this requires a server restart before taking effect.",
  "Enable Testing Commands: ",
  "Session length AD/LDAP and email (days):",
  "The number of days from the last time a user entered their credentials to the expiry of the user's session. After changing this setting, the new session length will take effect after the next time the user enters their credentials.",
  "When true, incoming webhooks will be allowed. To help combat phishing attacks, all posts from webhooks will be labelled by a BOT tag. See <a href='http://docs.mattermost.com/developer/webhooks-incoming.html' target='_blank'>documentation</a> to learn more.",
  "Enable Incoming Webhooks: ",
  "Add team from sidebar menu",
  "Advanced",
  "Compliance and Auditing",
  "Authentication",
  "High Availability (Beta)",
  "Compliance",
  "Configuration",
  "Connections",
  "Custom Branding",
  "Custom Emoji",
  "Custom Integrations",
  "Customization",
  "Database",
  "Developer",
  "Email",
  "External Services",
  "Files",
  "General",
  "GitLab",
  "Images",
  "Integrations",
  "AD/LDAP",
  "Legal and Support",
  "Edition and License",
  "Localization",
  "Logging",
  "Login",
  "Logs",
  "Mattermost App Links",
  "Notifications",
  "OAuth 2.0",
  "OTHER",
  "Password",
  "Policy",
  "Privacy",
  "Public Links",
  "Mobile Push",
  "Rate Limiting",
  "REPORTING",
  "Remove team from sidebar menu",
  "SAML",
  "Security",
  "Sessions",
  "SETTINGS",
  "Sign Up",
  "Sign Up",
  "Team Statistics",
  "Storage",
  "Legal and Support",
  "TEAMS ({count, number})",
  "Users",
  "Users and Teams",
  "Site Statistics",
  "WebRTC (Beta)",
  "System Console",
  "Data Source:",
  "Driver Name:",
  "32-character salt available to encrypt and decrypt sensitive fields in database.",
  "E.g.: \"gxHVDcKUyP2y1eiyW8S8na1UYQAfq6J6\"",
  "At Rest Encrypt Key:",
  "Maximum number of idle connections held open to the database.",
  "E.g.: \"10\"",
  "Maximum Idle Connections:",
  "Maximum number of open connections held open to the database.",
  "E.g.: \"10\"",
  "Maximum Open Connections:",
  "Changing properties in this section will require a server restart before taking effect.",
  "Note:",
  "Data Source Replicas:",
  "(Development Mode) When true, executing SQL statements are written to the log.",
  "Trace: ",
  "Warning: regenerating this salt may cause some columns in the database to return empty results.",
  "Link to About page for more information on your Mattermost deployment, for example its purpose and audience within your organization. Defaults to Mattermost information page.",
  "About link:",
  "Email address displayed on email notifications and during tutorial for end users to ask support questions.",
  "Support Email:",
  "Link to help documentation from team site main menu. Typically not changed unless your organization chooses to create custom documentation.",
  "Help link:",
  "If linking to an external site, URLs should begin with http:// or https://.",
  "Note:",
  "Link to Privacy Policy available to users on desktop and on mobile. Leaving this blank will hide the option to display a notice.",
  "Privacy Policy link:",
  "Link to help documentation from team site main menu. By default this points to the peer-to-peer troubleshooting forum where users can search for, find and request help with technical issues.",
  "Report a Problem link:",
  "Link to the terms under which users may use your online service. By default, this includes the \"Mattermost Conditions of Use (End Users)\" explaining the terms under which Mattermost software is provided to end users. If you change the default link to add your own terms for using the service you provide, your new terms must include a link to the default terms so end users are aware of the Mattermost Conditions of Use (End User) for Mattermost software.",
  "Terms of Service link:",
  "Active Users With Posts",
  "the System",
  "Total Posts",
  "Enable custom branding to show an image of your choice, uploaded below, and some help text, written below, on the login page.",
  "All team communication in one place, searchable and accessible anywhere",
  "Description of service shown in login screens and UI. When not specified, \"All team communication in one place, searchable and accessible anywhere\" is displayed.",
  "Site Description: ",
  "Custom Brand Image:",
  "Text that will appear below your custom brand image on your login screen. Supports Markdown-formatted text. Maximum 500 characters allowed.",
  "Custom Brand Text:",
  "Enable Custom Branding: ",
  "Choose New Image",
  "When true, teams that are configured to show in team directory will show on main page inplace of creating a new team.",
  "Enable Team Directory: ",
  "Maximum total number of users per team, including both active and inactive users.",
  "E.g.: \"25\"",
  "Max Users Per Team:",
  "No brand image uploaded",
  "When true, anyone can signup for a user account on this server without the need to be invited.",
  "Enable Open Server: ",
  "Teams and user accounts can only be created from a specific domain (e.g. \"mattermost.org\") or list of comma-separated domains (e.g. \"corp.mattermost.com, mattermost.org\").",
  "Enable users to open Direct Message channels with:",
  "'Any user on the Mattermost server' enables users to open a Direct Message channel with any user on the server, even if they are not on any teams together. 'Any member of the team' limits the ability to open Direct Message channels to only users who are in the same team.",
  "E.g.: \"corp.mattermost.com, mattermost.org\"",
  "When true, You cannot create a team name with reserved words like www, admin, support, test, channel, etc",
  "Restrict Team Names: ",
  "Restrict account creation to specified email domains:",
  "Any user on the Mattermost server",
  "Any member of the team",
  "Name of service shown in login screens and UI.",
  "E.g.: \"Mattermost\"",
  "Site Name:",
  "When false, only System Administrators can create teams.",
  "Enable Team Creation: ",
  "Upload",
  "Customize your user experience by adding a custom image to your login screen. Recommended maximum image size is less than 2 MB.",
  "Uploaded!",
  "Uploading..",
  "When false, the ability to create accounts is disabled. The create account button displays error when pressed.",
  "Enable Account Creation: ",
  "Active Users With Posts",
  "Total Posts",
  "true",
  "Users for {team}",
  "Users for {team} ({count})",
  ", <strong>Sign-in Method:</strong> Email",
  ", <strong>Sign-in Method:</strong> {service}",
  "If you demote yourself from the System Admin role and there is not another user with System Admin privileges, you'll need to re-assign a System Admin by accessing the Mattermost server through a terminal and running the following command.",
  "Confirm demotion from System Admin role",
  "Confirm Demotion",
  "platform -assign_role -team_name=\"yourteam\" -email=\"name@yourcompany.com\" -role=\"system_admin\"",
  "<strong>Email:</strong> {email}",
  "Inactive",
  "Make Active",
  "Make Inactive",
  "Make Member",
  "Make System Admin",
  "Make Team Admin",
  "Member",
  ", <strong>MFA</strong>: No",
  ", <strong>MFA</strong>: Yes",
  "Remove MFA",
  "Reset Password",
  "Switch to Email/Password",
  "System Admin",
  "Team Admin",
  "When true, Mattermost allows making <strong>one-on-one</strong> video calls. WebRTC calls are available on Chrome, Firefox and Mattermost Desktop Apps.",
  "Enable Mattermost WebRTC: ",
  "Enter your admin secret password to access the Gateway Admin URL.",
  "E.g.: \"PVRzWNN1Tg6szn7IQWvhpAvLByScWxdy\"",
  "Gateway Admin Secret:",
  "Enter https://<mattermost-webrtc-gateway-url>:<port>/admin. Make sure you use HTTP or HTTPS in your URL depending on your server configuration. Mattermost WebRTC uses this URL to obtain valid tokens for each peer to establish the connection.",
  "E.g.: \"https://webrtc.mattermost.com:7089/admin\"",
  "Gateway Admin URL:",
  "Enter wss://<mattermost-webrtc-gateway-url>:<port>. Make sure you use WS or WSS in your URL depending on your server configuration. This is the websocket used to signal and establish communication between the peers.",
  "E.g.: \"wss://webrtc.mattermost.com:8189\"",
  "Gateway Websocket URL:",
  "Enter your STUN URI as stun:<your-stun-url>:<port>. STUN is a standardized network protocol to allow an end host to assist devices to access its public IP address if it is located behind a NAT.",
  "E.g.: \"stun:webrtc.mattermost.com:5349\"",
  "STUN URI",
  "Enter your TURN Server Shared Key. This is used to created dynamic passwords to establish the connection. Each password is valid for a short period of time.",
  "E.g.: \"bXdkOWQxc3d0Ynk3emY5ZmsxZ3NtazRjaWg=\"",
  "TURN Shared Key:",
  "Enter your TURN URI as turn:<your-turn-url>:<port>. TURN is a standardized network protocol to allow an end host to assist devices to establish a connection by using a relay public IP address if it is located behind a symmetric NAT.",
  "E.g.: \"turn:webrtc.mattermost.com:5349\"",
  "TURN URI",
  "Enter your TURN Server Username.",
  "E.g.: \"myusername\"",
  "TURN Username:",
  "Disabled",
  "The Mattermost server will not serve static files.",
  "gzip",
  "The Mattermost server will serve static files compressed with gzip.",
  "gzip compression applies to static content files. It is recommended to enable gzip to improve performance unless your environment has specific restrictions, such as a web proxy that distributes gzip files poorly.",
  "Webserver Mode:",
  "Uncompressed",
  "The Mattermost server will serve static files uncompressed.",
  "Loading...",
  "Not enough data for a meaningful representation.",
  "Active Users With Posts",
  "Channel Types",
  "The Enterprise license expired on {date}. You have 15 days from this date to renew the license, please contact <a href='mailto:commercial@mattermost.com'>commercial@mattermost.com</a>.",
  "The Enterprise license is expiring on {date}. To renew your license, please contact <a href='mailto:commercial@mattermost.com'>commercial@mattermost.com</a>.",
  "Posts, Files and Hashtags",
  "Private Groups",
  "Public Channels",
  "Posts with Text-only",
  "System Statistics",
  "Total Channels",
  "Total Commands",
  "Posts with Files",
  "Posts with Hashtags",
  "Incoming Webhooks",
  "Outgoing Webhooks",
  "Total Posts",
  "Total Sessions",
  "Total Teams",
  "Total Users",
  "Active Users With Posts",
  "Newly Created Users",
  "Private Groups",
  "Public Channels",
  "Recent Active Users",
  "Recent Active Users",
  "Team Statistics for {team}",
  "Total Posts",
  "Total Users",
  "Account made active",
  "Account made inactive",
  "Action",
  "Attempted to allow a new OAuth service access",
  "Attempted to add new license",
  "Attempted to login",
  "Attempted to get an OAuth access token",
  "Attempted to change password",
  "Attempted to register a new OAuth Application with ID {id}",
  "Attempted to reset password",
  "Attempted to create a webhook",
  "Attempted to delete a webhook",
  " by {username}",
  " by an admin",
  "Created the {channelName} channel/group",
  "Deleted the channel/group with the URL {url}",
  "Established a direct message channel with {username}",
  "Failed to add a new license as it has either expired or not yet been started",
  "Failed to add an invalid license",
  "FAILED login attempt",
  "Failed to allow a new OAuth service access - the redirect URI did not match the previously registered callback",
  "Failed to change password - tried to update user password who was logged in through oauth",
  "Failed to create a webhook - bad channel permissions",
  "Failed to delete a webhook - inappropriate conditions",
  "Updated the {channelName} channel/group header",
  "IP Address",
  "Successfully removed a license",
  " (Login attempt)",
  " (Login failure)",
  "Logged out of your account",
  "member",
  "Updated the {channelName} channel/group name",
  "Failed to get an OAuth access token - {token}",
  "Revoked all current sessions for the team",
  "Sent an email to {email} to reset your password",
  "Session ID",
  "The session with id {sessionId} was revoked",
  "Successfully added new license",
  "Successfully logged in",
  "Successfully gave a new OAuth service access",
  "Successfully added a new OAuth service",
  "Successfully changed password",
  "Successfully reset password",
  "Successfully created a webhook",
  "Successfully deleted a webhook",
  "Timestamp",
  "Updated the general settings of your account",
  "Updated your global notification settings",
  "Updated your profile picture",
  "Updated user role(s) to ",
  "Added {username} to the {channelName} channel/group",
  "User ID",
  "Removed {username} to the {channelName} channel/group",
  "Sucessfully verified your email address",
  "Allow <strong>{appName}</strong> access?",
  "Allow",
  "The app <strong>{appName}</strong> would like the ability to access and modify your basic information.",
  "Deny",
  "<strong>{appName}</strong> would like to connect to your <strong>Mattermost</strong> user account",
  "Search",
  "Back to {siteName}",
  "Integrations",
  "Slash Commands",
  "Incoming Webhooks",
  "OAuth 2.0 Applications",
  "Outgoing Webhooks",
  "Calling",
  "Click here to jump to recent messages. ",
  "Add Members",
  "Close",
  "Must end with a letter or number",
  "Invalid URL",
  "Must be longer than two characters",
  "Can not contain two underscores in a row.",
  "Must start with a letter or number",
  "A channel with that URL already exists",
  "Some characters are not allowed in URLs and may be removed.",
  "Change {term} URL",
  "Channel",
  "Create {term}",
  "Group",
  "Channel URL must be 2 or more lowercase alphanumeric characters",
  "Invalid Channel Name",
  "Set {term} URL",
  "Channel",
  "Set Channel Header...",
  "Delete {term}...",
  "Flagged Posts",
  "Group",
  "Leave {term}",
  "Manage Members",
  "Notification Preferences",
  "Recent Mentions",
  "Rename {term}...",
  "Set {term} Header...",
  "Set {term} Purpose...",
  "View Info",
  "View Members",
  "Start Video Call",
  "New call unavailable until your existing call ends",
  "About",
  "Close",
  "Header:",
  "ID: ",
  "Name:",
  "No Channel Found",
  "Purpose:",
  "URL:",
  " Add",
  "Add New Members to ",
  "Close",
  "There appears to be a problem with your internet connection.",
  "Posted",
  "Please check connection, Mattermost unreachable. If issue persists, ask administrator to check WebSocket port.",
  "Someone",
  " did something new",
  "We received an unexpected status code from the server.",
  " uploaded a file",
  " uploaded an image",
  " wrote: ",
  " Add New Members",
  "Close",
  "Remove",
  " Members",
  "Cancel",
  "Channel",
  "Create New ",
  "Describe how this {term} should be used.",
  "This field is required",
  "Edit",
  "Group",
  "Header",
  "Set text that will appear in the header of the {term} beside the {term} name. For example, include frequently used links by typing [Link Title](http://example.com).",
  "New ",
  "Name",
  "E.g.: \"Bugs\", \"Marketing\", \"客户支持\"",
  "(optional)",
  "Create a new private group with restricted membership. ",
  "Create a private group",
  "Create a public channel",
  "Create a new public channel anyone can join. ",
  "Purpose",
  "For all activity",
  "For all unread messages",
  "Global default ({notifyLevel})",
  "Mark Channel Unread",
  "Never",
  "Only for mentions",
  "Selecting an option other than \"Default\" will override the global notification settings. Desktop notifications are available on Firefox, Safari, and Chrome.",
  "Notification Preferences for ",
  "Send desktop notifications",
  "The channel name is bolded in the sidebar when there are unread messages. Selecting \"Only for mentions\" will bold the channel only when you are mentioned.",
  "--- Select a channel ---",
  "(Direct Message)",
  "Type channel name. Use ↑↓ to browse, TAB to select, ↵ to confirm, ESC to dismiss",
  "No matches found.",
  "Switch",
  "Switch Channels",
  "No email specified",
  "Enter the ID and password for your AD/LDAP account",
  "Enter the password for your {site} email account",
  "AD/LDAP ID",
  "Please enter your AD/LDAP ID.",
  "Please enter your AD/LDAP password.",
  "AD/LDAP Password",
  "Password",
  "Please enter your password.",
  "You must already have a valid AD/LDAP account",
  "Upon claiming your account, you will only be able to login with AD/LDAP",
  "Switch account to AD/LDAP",
  "Switch Email/Password Account to AD/LDAP",
  "Enter the password for your {site} account",
  "Password",
  "Please enter your password.",
  "You must already have a valid {type} account",
  "Upon claiming your account, you will only be able to login with {type} SSO",
  "Switch account to {uiType}",
  "Switch Email/Password Account to {uiType}",
  "Confirm Password",
  "You will use the email {email} to login",
  "Enter your {ldapPassword} for your {site} email account",
  "Enter a new password for your email account",
  "Please enter your AD/LDAP password.",
  "AD/LDAP Password",
  "Password",
  "Please enter your password.",
  "Passwords do not match.",
  "Upon claiming your account, you will only be able to login with your email and password",
  "Switch account to email/password",
  "Switch AD/LDAP Account to Email/Password",
  "Confirm Password",
  "Upon changing your account type, you will only be able to login with your email and password.",
  "Enter a new password for your {site} email account",
  "Please enter a password.",
  "New Password",
  "Password do not match.",
  "Switch {type} to email and password",
  "Switch {type} Account to Email",
  "Cancel",
  "Add a comment...",
  "Add Comment",
  "Comment length must be less than {max} characters.",
  "Comment",
  "File uploading",
  "Files uploading",
  "Comment",
  "Post",
  "Keyboard shortcuts are not supported on your device.",
  "<h4>Sending Messages</h4><p>Type here to write a message and press <strong>ENTER</strong> to post it.</p><p>Click the <strong>Attachment</strong> button to upload an image or a file.</p>",
  "Write a message...",
  "By proceeding to create your account and use {siteName}, you agree to our <a href='/static/help/terms.html'>Terms of Service</a> and <a href='/static/help/privacy.html'>Privacy Policy</a>. If you do not agree, you cannot use {siteName}.",
  "Back to previous step",
  "Name must be 4 or more characters up to a maximum of 15",
  "Name your team in any language. Your team name shows in menus and headings.",
  "Next",
  "This field is required",
  "Team Name",
  "Back to previous step",
  "Name must be 4 or more characters up to a maximum of 15",
  "Creating team...",
  "Finish",
  "<li>Short and memorable is best</li><li>Use lowercase letters, numbers and dashes</li><li>Must start with a letter and can't end in a dash</li>",
  "Use only lower case letters, numbers and dashes. Must start with a letter and can't end in a dash.",
  "This field is required",
  "URL is taken or contains a reserved word",
  "Team URL",
  "This URL is unavailable. Please try another.",
  "Choose the web address of your new team:",
  "No custom emoji found",
  "Custom Emoji",
  "Search Custom Emoji",
  "Cancel",
  "channel",
  "Confirm DELETE Channel",
  "Delete",
  "group",
  "Are you sure you wish to delete the {display_name} {term}?",
  "Cancel",
  "Comment",
  "Confirm {term} Delete",
  "Delete",
  "Post",
  "Are you sure you want to delete this {term}?",
  "This post has {count} comment(s) on it.",
  "Cancel",
  "Edit the text appearing next to the channel name in the channel header.",
  "This channel header is too long, please enter a shorter one",
  "Save",
  "Edit Header for {channel}",
  "Edit Header",
  "Describe how this {type} should be used. This text appears in the channel list in the \"More...\" menu and helps others decide whether to join.",
  "Cancel",
  "Channel",
  "This channel purpose is too long, please enter a shorter one",
  "Group",
  "Save",
  "Edit Purpose",
  "Edit Purpose for ",
  "Cancel",
  "Edit {title}",
  "Edit the post...",
  "Save",
  "Email Address",
  "Create Team",
  "Please enter a valid email address.",
  "Find my teams",
  "{siteName}: You are almost done",
  " Failed to send verification email.",
  "Please verify your email address. Check your inbox for an email.",
  "Resend Email",
  " Verification email sent.",
  "{siteName} Email Verified",
  "<p>Your email has been verified! Click <a href={url}>here</a> to log in.</p>",
  "Failed to verify your email.",
  "Actions",
  "Add Custom Emoji",
  "Creator",
  "Delete",
  "No Custom Emoji Found",
  "Custom emoji are available to everyone on your server. Type ':' in a message box to bring up the emoji selection menu. Other users may need to refresh the page before new emojis appear.",
  "Tip: If you add #, ##, or ### as the first character on a new line containing emoji, you can use larger sized emoji. To try it out, send a message such as: '# :smile:'.",
  "Image",
  "Name",
  "Search Custom Emoji",
  "Somebody on another team",
  "Mattermostに戻る",
  "探しているページは存在しません。",
  "ページが見付かりません",
  "Private browsing is not supported",
  "Browser not supported",
  "Enterprise license has expired; you have 15 days from expiry to renew the license, please contact commercial@mattermost.com for details",
  "The Enterprise license is expiring on {date}. To renew your license, please contact commercial@mattermost.com",
  "Enterprise license has expired, please contact your System Administrator for details",
  "Preview Mode: Email notifications have not been configured",
  "Download",
  "Size ",
  "File type ",
  "File above {max}MB cannot be uploaded: {filename}",
  "Files above {max}MB cannot be uploaded: {filenames}",
  "Uploads limited to {count} files maximum. Please use additional posts for more files.",
  "Image Pasted at ",
  "{count} {count, plural, =0 {0 channels} one {channel} other {channels}}",
  "{count} {count, plural, =0 {0 channels} one {channel} other {channels}} of {total} Total",
  "Search channels",
  "All Users",
  "{count} {count, plural, =0 {0 members} one {member} other {members}}",
  "{count} {count, plural, =0 {0 members} one {member} other {members}} of {total} Total",
  "Member",
  "Search members",
  "Filter:",
  "Members of this Team",
  "Email",
  "An email was sent with links to any teams to which you are a member.",
  "Find Your Team",
  "Get an email with links to any teams to which you are a member.",
  "you@domain.com",
  "Send",
  "Please enter a valid email address",
  "Flag for follow up",
  "Unflag",
  "Please choose a new name for your team",
  "Click 'Edit' to regenerate Invite Code.",
  "The Invite Code is used as part of the URL in the team invitation link created by <strong>Get Team Invite Link</strong> in the main menu. Regenerating creates a new team invitation link and invalidates the previous link.",
  "Invite Code",
  "Team Directory has been disabled.  Please ask a System Admin to enable the Team Directory in the System Console team settings.",
  "Team directory is turned off for this system.",
  "Including this team will display the team name from the Team Directory section of the Home Page, and provide a link to the sign-in page.",
  "Include this team in the Team Directory",
  "No",
  "When allowed, a link to this team will be included on the landing page allowing anyone with an account to join this team.",
  "Allow any user with an account on this server to join this team",
  "Regenerate",
  "This field is required",
  "Team Name",
  "Set the name of the team as it appears on your sign-in screen and at the top of the left-hand sidebar.",
  "General Settings",
  "Yes",
  "Already have it?",
  "Mattermost for Android",
  "Mattermost works best if you switch to our Android app",
  "continue",
  "Or {link}",
  "continue with browser",
  "Mattermost works best if you switch to our iPhone app",
  "Mattermost, Inc",
  "Open Mattermost",
  " Link copied to clipboard.",
  "Close",
  "Copy Link",
  "The link below allows authorized users to see your post.",
  "Copy Permalink",
  "Send teammates the link below for them to sign-up to this team site. The Team Invite Link can be shared with multiple teammates as it does not change unless it's regenerated in Team Settings by a Team Admin.",
  "User creation has been disabled for your team. Please ask your Team Administrator for details.",
  "Team Invite Link",
  "#### Downloading Files\nDownload an attached file by clicking the download icon next to the file thumbnail or by opening the file previewer and clicking **Download**.",
  "#### Drag and Drop\nUpload a file or selection of files by dragging the files from your computer into the RHS or center pane. Dragging and dropping attaches the files to the message input box, then you can optionally type a message and press **ENTER** to post.",
  "#### Attachment Icon\nAlternatively, upload files by clicking the grey paperclip icon inside the message input box. This opens up your system file viewer where you can navigate to the desired files and then click **Open** to upload the files to the message input box. Optionally type a message and then press **ENTER** to post.",
  "## File Size Limitations\nMattermost supports a maximum of five attached files per post, each with a maximum file size of 50Mb.",
  "## Attachment Methods\nAttach a file by drag and drop or by clicking the attachment icon in the message input box.",
  "Document preview (Word, Excel, PPT) is not yet supported.",
  "#### Pasting Images\nOn Chrome and Edge browsers, it is also possible to upload files by pasting them from the clipboard. This is not yet supported on other browsers.",
  "## File Previewer\nMattermost has a built in file previewer that is used to view media, download files and share public links. Click the thumbnail of an attached file to open it in the file previewer.",
  "#### Sharing Public Links\nPublic links allow you to share file attachments with people outside your Mattermost team. Open the file previewer by clicking on the thumbnail of an attachment, then click **Get Public Link**. This opens a dialog box with a link to copy. When the link is shared and opened by another user, the file will automatically download.",
  "If **Get Public Link** is not visible in the file previewer and you prefer the feature enabled, you can request that your System Admin enable the feature from the System Console under **Security** > **Public Links**.",
  "#### Supported Media Types\nIf you are trying to preview a media type that is not supported, the file previewer will open a standard media attachment icon. Supported media formats depend heavily on your browser and operating system, but the following formats are supported by Mattermost on most browsers:",
  "- Images: BMP, GIF, JPG, JPEG, PNG\n- Video: MP4\n- Audio: MP3, M4A\n- Documents: PDF",
  "# Attaching Files\n_____",
  "## Built-in Commands\nThe following slash commands are available on all Mattermost installations:",
  "Begin by typing `/` and a list of slash command options appears above the text input box. The autocomplete suggestions help by providing a format example in black text and a short description of the slash command in grey text.",
  "## Custom Commands\nCustom slash commands integrate with external applications. For example, a team might configure a custom slash command to check internal health records with `/patient joe smith` or check the weekly weather forcast in a city with `/weather toronto week`. Check with your System Admin or open the autocomplete list by typing `/` to determine if your team configured any custom slash commands.",
  "Custom slash commands are disabled by default and can be enabled by the System Admin in the **System Console** > **Integrations** > **Webhooks and Commands**. Learn about configuring custom slash commands on the [developer slash command documentation page](http://docs.mattermost.com/developer/slash-commands.html).",
  "Slash commands perform operations in Mattermost by typing into the text input box. Enter a `/` followed by a command and some arguments to perform actions.\n\nBuilt-in slash commands come with all Mattermost installations and custom slash commands are configurable to interact with external applications. Learn about configuring custom slash commands on the [developer slash command documentation page](http://docs.mattermost.com/developer/slash-commands.html).",
  "# Executing Commands\n___",
  "## Deleting a message\nDelete a message by clicking the **[...]** icon next to any message text that you’ve composed, then click **Delete**. System and Team Admins can delete any message on their system or team.",
  "## Editing a Message\nEdit a message by clicking the **[...]** icon next to any message text that you’ve composed, then click **Edit**. After making modifications to the message text, press **ENTER** to save the modifications. Message edits do not trigger new @mention notifications, desktop notifications or notification sounds.",
  "## Linking to a message\nThe **Permalink** feature creates a link to any message. Sharing this link with other users in the channel lets them view the linked message in the Message Archives. Users who are not a member of the channel where the message was posted cannot view the permalink. Get the permalink to any message by clicking the **[...]** icon next to the message text > **Permalink** > **Copy Link**.",
  "## Posting a Message\nWrite a message by typing into the text input box, then press **ENTER** to send it. Use **Shift + ENTER** to create a new line without sending a message. To send messages by pressing **CTRL+ENTER** go to **Main Menu > Account Settings > Send messages on CTRL + ENTER**.",
  "#### Posts\nPosts can be considered parent messages. They are the messages that often start a thread of replies. Posts are composed and sent from the text input box at the bottom of the center pane.",
  "#### Replies\nReply to a message by clicking the reply icon next to any message text. This action opens the right-hand sidebar where you can see the message thread, then compose and send your reply. Replies are indented slightly in the center pane to indicate that they are child messages of a parent post.\n\nWhen composing a reply in the right-hand side, click the expand/collapse icon with two arrows at the top of the sidebar to make things easier to read.",
  "# Sending Messages\n_____",
  "## Message Types\nReply to posts to keep conversations organized in threads.",
  "Make a task list by including square brackets:",
  "- [ ] Item one\n- [ ] Item two\n- [x] Completed item",
  "## Code Block\n\nCreate a code block by indenting each line by four spaces, or by placing ``` on the line above and below your code.",
  "Code block",
  ":smile: :+1: :sheep:",
  "## Emojis\n\nOpen the emoji autocomplete by typing `:`. A full list of emojis can be found [here](http://www.emoji-cheat-sheet.com/). It is also possible to create your own [Custom Emoji](http://docs.mattermost.com/help/settings/custom-emoji.html) if the emoji you want to use doesn't exist.",
  "Example:",
  "**GitHub Theme**",
  "## Headings\n\nMake a heading by typing # and a space before your title. For smaller headings, use more #’s.",
  "Alternatively, you can underline the text using `===` or `---` to create headings.",
  "Large Heading\n-------------",
  "## Large Heading\n### Smaller Heading\n#### Even Smaller Heading",
  "## In-line Images\n\nCreate in-line images using an `!` followed by the alt text in square brackets and the link in normal brackets. Add hover text by placing it in quotes after the link.",
  "![alt text](link \"hover text\")\n\nand\n\n[![Build Status](https://travis-ci.org/mattermost/platform.svg?branch=master)](https://travis-ci.org/mattermost/platform) [![Github](https://assets-cdn.github.com/favicon.ico)](https://github.com/mattermost/platform)",
  "## In-line Code\n\nCreate in-line monospaced font by surrounding it with backticks.",
  "Markdown makes it easy to format messages. Type a message as you normally would, and use these rules to render it with special formatting.",
  "## Lines\n\nCreate a line by using three `*`, `_`, or `-`.",
  "[Check out Mattermost!](https://about.mattermost.com/)",
  "## Links\n\nCreate labeled links by putting the desired text in square brackets and the associated link in normal brackets.",
  "* list item one\n* list item two\n    * item two sub-point",
  "## Lists\n\nCreate a list by using `*` or `-` as bullets. Indent a bullet point by adding two spaces in front of it.",
  "**Monokai Theme**",
  "Make it an ordered list by using numbers instead:",
  "1. Item one\n2. Item two",
  "## Block quotes\n\nCreate block quotes using `>`.",
  "`> block quotes` renders as:",
  "> block quotes",
  "Renders as:",
  "**Solarized Dark Theme**",
  "**Solarized Light Theme**",
  "## Text Style\n\nYou can use either `_` or `*` around a word to make it italic. Use two to make it bold.\n\n* `_italics_` renders as _italics_\n* `**bold**` renders as **bold**\n* `**_bold-italic_**` renders as **_bold-italics_**\n* `~~strikethrough~~` renders as ~~strikethrough~~",
  "Supported languages are:\n`as`, `applescript`, `osascript`, `scpt`, `bash`, `sh`, `zsh`, `clj`, `boot`, `cl2`, `cljc`, `cljs`, `cljs.hl`, `cljscm`, `cljx`, `hic`, `coffee`, `_coffee`, `cake`, `cjsx`, `cson`, `iced`, `cpp`, `c`, `cc`, `h`, `c++`, `h++`, `hpp`, `cs`, `csharp`, `css`, `d`, `di`, `dart`, `delphi`, `dpr`, `dfm`, `pas`, `pascal`, `freepascal`, `lazarus`, `lpr`, `lfm`, `diff`, `django`, `jinja`, `dockerfile`, `docker`, `erl`, `f90`, `f95`, `fsharp`, `fs`, `gcode`, `nc`, `go`, `groovy`, `handlebars`, `hbs`, `html.hbs`, `html.handlebars`, `hs`, `hx`, `java`, `jsp`, `js`, `jsx`, `json`, `jl`, `kt`, `ktm`, `kts`, `less`, `lisp`, `lua`, `mk`, `mak`, `md`, `mkdown`, `mkd`, `matlab`, `m`, `mm`, `objc`, `obj-c`, `ml`, `perl`, `pl`, `php`, `php3`, `php4`, `php5`, `php6`, `ps`, `ps1`, `pp`, `py`, `gyp`, `r`, `ruby`, `rb`, `gemspec`, `podspec`, `thor`, `irb`, `rs`, `scala`, `scm`, `sld`, `scss`, `st`, `sql`, `swift`, `tex`, `vbnet`, `vb`, `bas`, `vbs`, `v`, `veo`, `xml`, `html`, `xhtml`, `rss`, `atom`, `xsl`, `plist`, `yaml`",
  "### Syntax Highlighting\n\nTo add syntax highlighting, type the language to be highlighted after the ``` at the beginning of the code block. Mattermost also offers four different code themes (GitHub, Solarized Dark, Solarized Light, Monokai) that can be changed in **Account Settings** > **Display** > **Theme** > **Custom Theme** > **Center Channel Styles**",
  "    package main\n    import \"fmt\"\n    func main() {\n        fmt.Println(\"Hello, 世界\")\n    }",
  "| Left-Aligned  | Center Aligned  | Right Aligned |\n| :------------ |:---------------:| -----:|\n| Left column 1 | this text       |  $100 |\n| Left column 2 | is              |   $10 |\n| Left column 3 | centered        |    $1 |",
  "## Tables\n\nCreate a table by placing a dashed line under the header row and separating the columns with a pipe `|`. (The columns don’t need to line up exactly for it to work). Choose how to align table columns by including colons `:` within the header row.",
  "# Formatting Text\n_____",
  "Learn more about:",
  "Attaching Files",
  "Executing Commands",
  "Composing Messages and Replies",
  "Formatting Messages using Markdown",
  "Mentioning Teammates",
  "Basic Messaging",
  "#### @Channel\nYou can mention an entire channel by typing `@channel`. All members of the channel will receive a mention notification that behaves the same way as if the members had been mentioned personally.",
  "@channel great work on interviews this week. I think we found some excellent potential candidates!",
  "## @Mentions\nUse @mentions to get the attention of specific team members.",
  "## Recent Mentions\nClick `@` next to the search box to query for your most recent @mentions and words that trigger mentions. Click **Jump** next to a search result in the RHS to jump the center pane to the channel and location of the message with the mention.",
  "# Mentioning Teammates\n_____",
  "## Words That Trigger Mentions\nIn addition to being notified by @username and @channel, you can customize words that trigger mention notifications in **Account Settings** > **Notifications** > **Words that trigger mentions**. By default, you will receive mention notifications on your first name, and you can add more words by typing them into the input box separated by commas. This is useful if you want to be notified of all posts on certain topics, for example, “interviewing” or “marketing”.",
  "#### @Username\nYou can mention a teammate by using the `@` symbol plus their username to send them a mention notification.\n\nType `@` to bring up a list of team members who can be mentioned. To filter the list, type the first few letters of any username, first name, last name, or nickname. The **Up** and **Down** arrow keys can then be used to scroll through entries in the list, and pressing **ENTER** will select which user to mention. Once selected, the username will automatically replace the full name or nickname.\nThe following example sends a special mention notification to **alice** that alerts her of the channel and message where she has been mentioned. If **alice** is away from Mattermost and has [email notifications](http://docs.mattermost.com/help/getting-started/configuring-notifications.html#email-notifications) turned on, then she will receive an email alert of her mention along with the message text.",
  "If the user you mentioned does not belong to the channel, a System Message will be posted to let you know. This is a temporary message only seen by the person who triggered it. To add the mentioned user to the channel, go to the dropdown menu beside the channel name and select **Add Members**.",
  "@alice how did your interview go with the new candidate?",
  "**Attach files** by dragging and dropping into Mattermost or clicking the attachment icon in the text input box.",
  "**Quickly add emoji** by typing \":\", which will open an emoji autocomplete. If the existing emoji don't cover what you want to express, you can also create your own [Custom Emoji](http://docs.mattermost.com/help/settings/custom-emoji.html).",
  "**Format your messages** using Markdown that supports text styling, headings, links, emoticons, code blocks, block quotes, tables, lists and in-line images.",
  "**Notify teammates** when they are needed by typing `@username`.",
  "**Reply to messages** by clicking the reply arrow next to the message text.",
  "# Messaging Basics\n_____",
  "**Write messages** using the text input box at the bottom of Mattermost. Press **ENTER** to send a message. Use **Shift+ENTER** to create a new line without sending a message.",
  "Slash Commands",
  "Add Slash Command",
  "No commands found",
  "Slash Commands",
  "Create slash commands for use in external integrations. Please see the {link} to learn more.",
  "documentation",
  "Search Slash Commands",
  "Unnamed Slash Command",
  "Add Incoming Webhook",
  "No incoming webhooks found",
  "Incoming Webhooks",
  "Create incoming webhook URLs for use in external integrations. Please see the {link} to learn more.",
  "documentation",
  "Search Incoming Webhooks",
  "A Private Webhook",
  "Callback URLs: {urls}",
  "Client ID: <strong>{clientId}</strong>",
  "Client Secret: <strong>{clientSecret}</strong>",
  "Content-Type: {contentType}",
  "Created by {creator} on {createAt, date, full}",
  "Delete",
  "Hide Secret",
  "Regenerate Secret",
  "Regenerate Token",
  "Show Secret",
  "Token: {token}",
  "Trigger When: {triggerWhen}",
  "Trigger Words: {triggerWords}",
  "Unnamed OAuth 2.0 Application",
  "URL: {url}",
  "Add OAuth 2.0 Application",
  "Callback URLs (One Per Line)",
  "Cancel",
  "Description",
  "No OAuth 2.0 Applications found",
  "OAuth 2.0 Applications",
  "Create OAuth 2.0 applications to securely integrate bots and third-party applications with Mattermost. Please see {link} to learn more.",
  "documentation",
  "Homepage",
  "Icon URL",
  "Is Trusted: <strong>{isTrusted}</strong>",
  "Display Name",
  "Save",
  "Search OAuth 2.0 Applications",
  "Is Trusted",
  "No",
  "Yes",
  "Add Outgoing Webhook",
  "No outgoing webhooks found",
  "Outgoing Webhooks",
  "Create outgoing webhook URLs for use in external integrations. Please see the {link} to learn more.",
  "documentation",
  "Search Outgoing Webhooks",
  "A Private Webhook",
  "Add",
  "Slash commands send events to external integrations",
  "Slash Command",
  "Done",
  "Integrations",
  "Incoming webhooks allow external integrations to send messages",
  "Incoming Webhook",
  "OAuth 2.0 allows external applications to make authorized requests to the Mattermost API.",
  "OAuth 2.0 Applications",
  "Outgoing webhooks allow external integrations to receive and respond to messages",
  "Outgoing Webhook",
  "Setup Successful",
  "This is the start of your direct message history with {teammate}.<br />Direct messages and files shared here are not shown to people outside this area.",
  " Any member can join and read this channel.",
  "Beginning of {name}",
  "channel",
  "This is the start of the <strong>{name}</strong> {type}, created by <strong>{creator}</strong> on <strong>{date}</strong>",
  "<h4 class='channel-intro__title'>Beginning of {display_name}</h4><p class='channel-intro__content'><strong>Welcome to {display_name}!</strong><br/><br/>This is the first channel teammates see when they sign up - use it for posting updates everyone needs to know.</p>",
  "private group",
  "Invite others to this {type}",
  "Invite others to this team",
  "This is the start of the {name} {type}, created on {date}.",
  "<h4 class=\"channel-intro__title\">Beginning of {display_name}</h4><p class=\"channel-intro__content\">This is the start of {display_name}, a channel for non-work-related conversations.<br/></p>",
  " Only invited members can see this private group.",
  "Set a Header",
  "This is the start of your direct message history with this teammate. Direct messages and files shared here are not shown to people outside this area.",
  "Add another",
  "People invited automatically join the <strong>{channel}</strong> channel.",
  "Cancel",
  "Email is currently disabled for your team, and email invitations cannot be sent. Contact your System Administrator to enable email and email invitations.",
  "User creation has been disabled for your team. Please ask your Team Administrator for details.",
  "Please enter a valid email address",
  "First name",
  "Team Invite Link",
  "Last name",
  "Yes, Discard",
  "You have unsent invitations, are you sure you want to discard them?",
  "Discard Invitations?",
  "Invite New Member",
  "Send Invitation",
  "Send Invitations",
  " Sending",
  "You can also invite people using the {link}.",
  "Find my teams",
  "Create team with AD/LDAP Account",
  "Name must be 3 or more characters up to a maximum of 15",
  "Enter name of new team",
  "Please enter a team name",
  "全ての公開チャンネルと非公開グループから脱退します。  チームが非公開な場合、再度参加することはできません。  実行してよろしいですか?",
  "いいえ",
  "チームから脱退しますか?",
  "はい",
  "Loading",
  " Sign-in method changed successfully",
  "Create one now",
  "Create a new team",
  "This option is only available for System Administrators, and does not show up for other users.",
  "Email",
  "Find your other teams",
  "I forgot my password",
  "GitLab",
  "Google Apps",
  "Your password is incorrect.",
  "AD/LDAP Username",
  "AD/LDAP username",
  "Don't have an account? ",
  "Please enter your email",
  "Please enter your email or {ldapUsername}",
  "Please enter your email or username",
  "Please enter your email, username or {ldapUsername}",
  "Please enter your {ldapUsername}",
  "No sign-in methods are enabled. Please contact your System Administrator.",
  "Please enter your password",
  "Please enter your username",
  "Please enter your username or {ldapUsername}",
  "Office 365",
  "on {siteName}",
  "or",
  "Password",
  " Password updated successfully",
  " Your session has expired. Please login again.",
  "Sign in",
  "Sign in with:",
  "We couldn't find an account matching your login credentials.",
  "Username",
  " Email Verified",
  "To complete the sign in process, please enter a token from your smartphone's authenticator",
  "Submit",
  "MFA Token",
  "Please enter an MFA token",
  "Make Admin",
  "Member",
  "No users to add.",
  "Message",
  "Members",
  "Close",
  "Create New Channel",
  "Click 'Create New Channel' to make a new one",
  "Join",
  "No more channels to join",
  "More Channels",
  "Close",
  "Message",
  "Direct Messages",
  "{users} and {last} are typing...",
  "{user} is typing...",
  "Someone",
  "Add Members",
  "Click here",
  "Delete Channel...",
  "Leave Channel",
  "Manage Members",
  "No channel header yet.{newline}{link} to add one.",
  "Notification Preferences",
  "Rename Channel...",
  "Set Channel Header...",
  "Set Channel Purpose...",
  "Toggle sidebar",
  "Toggle sidebar",
  "View Info",
  "About Mattermost",
  "Account Settings",
  "System Console",
  "Create a New Team",
  "Custom Emoji",
  "Help",
  "Integrations",
  "Invite New Member",
  "Leave Team",
  "Logout",
  "Manage Members",
  "Download Apps",
  "Report a Problem",
  "Switch to {team}",
  "Switch to ",
  "Get Team Invite Link",
  "Team Settings",
  "View Members",
  "Direct Message",
  "Change my password",
  "Click <a href={url}>here</a> to log in.",
  "Enter a new password for your {siteName} account.",
  "Please enter at least {chars} characters.",
  "Password",
  "Password Reset",
  "Your password has been updated successfully.",
  "Please check your inbox.",
  "To reset your password, enter the email address you used to sign up",
  "Email",
  "Please enter a valid email address.",
  "<p>A password reset link has been sent to <b>{email}</b></p>",
  "Reset my password",
  "Password Reset",
  "Download to read more pages",
  "Cancel",
  "Retry",
  "Permalink belongs to a deleted message or to a channel to which you do not have access.",
  "Show less...",
  "Show more...",
  "Commented on {name}{apostrophe} message: ",
  "(message deleted)",
  " plus {count} other files",
  " plus 1 other file",
  "Comment could not be posted",
  "Okay",
  "Someone deleted the message on which you tried to post a comment.",
  "Beginning of Channel Archives",
  "Delete",
  "Edit",
  "Flag",
  "Unflag",
  "Permalink",
  "Reply",
  "Load more messages",
  "New Messages",
  "the channel",
  "Removed from ",
  "Okay",
  "{remover} removed you from {channel}",
  "Someone",
  "Cancel",
  " - Cannot be changed for the default channel",
  "Display Name",
  "Enter display name",
  "Handle",
  "lowercase alphanumeric&#39;s only",
  "Must be lowercase alphanumeric characters",
  "This field must be less than 22 characters",
  "This field is required",
  "Save",
  "Rename Channel",
  "Comment",
  "Delete",
  "Edit",
  "Flag",
  "Unflag",
  "Permalink",
  "Back to Flagged Posts",
  "Back to Search Results",
  "Close Sidebar",
  "Message Details",
  "Expand Sidebar",
  "Shrink Sidebar",
  "Delete",
  "Direct Message",
  "Edit",
  "Flag",
  "Unflag",
  "Permalink",
  "Cancel",
  "Search",
  "<h4>Search Options</h4><ul><li><span>Use </span><b>\"quotation marks\"</b><span> to search for phrases</span></li><li><span>Use </span><b>from:</b><span> to find posts from specific users and </span><b>in:</b><span> to find posts in specific channels</span></li></ul>",
  "Search Results",
  "Recent Mentions",
  "Flagged Posts",
  "Direct Message (with {username})",
  "Jump",
  "<ul><li>If you're searching a partial phrase (ex. searching \"rea\", looking for \"reach\" or \"reaction\"), append a * to your search term.</li><li>Two letter searches and common words like \"this\", \"a\" and \"is\" won't appear in search results due to excessive results returned.</li></ul>",
  "No results found. Try again?",
  "<ul><li>Use <b>\"quotation marks\"</b> to search for phrases</li><li>Use <b>from:</b> to find posts from specific users and <b>in:</b> to find posts in specific channels</li></ul>",
  "You haven't flagged any messages yet.",
  "You can add a flag to messages and comments by clicking the ",
  " icon next to the timestamp.",
  "Flags are a way to mark messages for follow up. Your flags are personal, and cannot be seen by other users.",
  "Cancel",
  "Save",
  "Edit",
  "Cancel",
  "Upload a profile picture in either JPG or PNG format, at least {width}px in width and {height}px height.",
  "Save",
  "Select",
  "Import",
  "No file selected.",
  "Select file",
  "Channels",
  "Create new channel",
  "Create new group",
  "Direct Messages",
  "More",
  "More...",
  "Outside this team",
  "Private Groups",
  "Remove from list",
  "<h4>Channels</h4><p><strong>Channels</strong> organize conversations across different topics. They’re open to everyone on your team. To send private communications use <strong>Direct Messages</strong> for a single person or <strong>Private Groups</strong> for multiple people.</p>",
  "<h4>\"{townsquare}\" and \"{offtopic}\" channels</h4><p>Here are two public channels to start:</p><p><strong>{townsquare}</strong> is a place for team-wide communication. Everyone in your team is a member of this channel.</p><p><strong>{offtopic}</strong> is a place for fun and humor outside of work-related channels. You and your team can decide what other channels to create.</p>",
  "<h4>Creating and Joining Channels</h4><p>Click <strong>\"More...\"</strong> to create a new channel or join an existing one.</p><p>You can also create a new channel or private group by clicking the <strong>\"+\" symbol</strong> next to the channel or private group header.</p>",
  "Unread post(s) above",
  "Unread post(s) below",
  "<h4>Main Menu</h4><p>The <strong>Main Menu</strong> is where you can <strong>Invite New Members</strong>, access your <strong>Account Settings</strong> and set your <strong>Theme Color</strong>.</p><p>Team administrators can also access their <strong>Team Settings</strong> from this menu.</p><p>System administrators will find a <strong>System Console</strong> option to administrate the entire system.</p>",
  "Account Settings",
  "System Console",
  "Flagged Posts",
  "Help",
  "Invite New Member",
  "Logout",
  "Manage Members",
  "Download Apps",
  "Recent Mentions",
  "Report a Problem",
  "Team Selection",
  "Get Team Invite Link",
  "Team Settings",
  "View Members",
  "Email and Password",
  "GitLab Single-Sign-On",
  "Google Account",
  "AD/LDAP Credentials",
  "Office 365",
  "Create an account with:",
  "Your teams: ",
  "Or Create a Team",
  "Team creation has been disabled.  Please contact an administrator for access.",
  "Teams you can join: ",
  "There are no teams included in the Team Directory and team creation has been disabled.",
  "No teams are available to join. Please ask your administrator for an invite.",
  "No teams are available to join. Please create a new team or ask your administrator for an invite.",
  "No teams have been created. Please contact your administrator.",
  "No teams have been created. You may create one by clicking \"Create a new team\".",
  "No team creation method has been enabled.  Please contact an administrator for access.",
  "You've already completed the signup process for this invitation or this invitation has expired.",
  "Please check your email: <strong>{email}</strong><br />Your email contains a link to set up your team",
  "Sign up Complete",
  "Go to System Console",
  "Choose your password",
  "Choose your username",
  "Create Account",
  "Valid email required for sign-up",
  "Your email address is <strong>{email}</strong>. You'll use this address to sign in to {siteName}.",
  "You've already completed the signup process for this invitation or this invitation has expired.",
  "with GitLab",
  "with Google",
  "Already have an account?",
  "The invite link was invalid.  Please speak with your Administrator to receive an invitation.",
  "Let's create your account",
  "This server does not allow open signups.  Please speak with your Administrator to receive an invitation.",
  "No user creation method has been enabled.  Please contact an administrator for access.",
  "with Office 365",
  "on {siteName}",
  "or",
  "Please enter at least {min} characters",
  "This field is required",
  "This username is reserved, please choose a new one.",
  "Click here to sign in.",
  "Username must begin with a letter, and contain between {min} to {max} lowercase characters made up of numbers, letters, and the symbols '.', '-' and '_'",
  "Username must begin with a letter, and contain between {min} to {max} lowercase characters made up of numbers, letters, and the symbols '.', '-' and '_'.",
  "Please enter a valid email address",
  "Welcome to:",
  "What's your email address?",
  "With your AD/LDAP credentials",
  "Find my teams",
  "Create team with GitLab Account",
  "Create team with Google Apps Account",
  "Name must be 3 or more characters up to a maximum of 15",
  "Enter name of new team",
  "Please enter a team name",
  "Notifies everyone in the channel, use in {townsquare} to notify the whole team",
  "Notifies everyone in the channel",
  "My Channels",
  "Notifies everyone in the channel and online",
  "Channel Members",
  "Other Channels",
  "Not in Channel",
  "Special Mentions",
  "Private Groups",
  "Public Channels",
  "download",
  "Export",
  "Export your team",
  " Exporting...",
  " Ready for ",
  " Unable to export: {error}",
  " Import failure: ",
  "Import",
  "<p>To import a team from Slack go to Slack > Team Settings > Import/Export Data > Export > Start Export. Slack does not allow you to export files, images, private groups or direct messages stored in Slack. Therefore, Slack import to Mattermost only supports importing of text messages in your Slack team's public channels.</p><p>The Slack import to Mattermost is in 'Beta'. Slack bot posts do not yet import.</p>",
  "Import from Slack (Beta)",
  " Importing...",
  " Import successful: ",
  "View Summary",
  "Close",
  "{team} Members",
  "If you demote yourself from the System Admin role and there is not another user with System Admin privileges, you'll need to re-assign a System Admin by accessing the Mattermost server through a terminal and running the following command.",
  "Confirm demotion from System Admin role",
  "Confirm Demotion",
  "platform -assign_role -team_name=\"yourteam\" -email=\"name@yourcompany.com\" -role=\"system_admin\"",
  "Inactive",
  "Remove From Team",
  "Make Active",
  "Make Team Admin",
  "Make Inactive",
  "Make Member",
  "Member",
  "System Admin",
  "Team Admin",
  "Export",
  "General",
  "Import",
  "Team Settings",
  "**bold**",
  "Edit message",
  "Help",
  "`inline code`",
  "_italic_",
  "```preformatted```",
  "Preview",
  ">quote",
  "strike",
  "You’re all set",
  "Click “Next” to enter {channel}. This is the first channel teammates see when they sign up. Use it for posting updates everyone needs to know.",
  "Invite teammates",
  "Install the apps for {link} for easy access and notifications on the go.",
  "PC, Mac, iOS and Android",
  "Next",
  "<h3>Welcome to:</h3><h1>Mattermost</h1><p>Your team communication all in one place, instantly searchable and available anywhere.</p><p>Keep your team connected to help them achieve what matters most.</p>",
  "<h3>How Mattermost works:</h3><p>Communication happens in public discussion channels, private groups and direct messages.</p><p>Everything is archived and searchable from any web-enabled desktop, laptop or phone.</p>",
  "Skip tutorial",
  "Need anything, just email us at ",
  "Invite teammates",
  " when you’re ready.",
  "Next",
  "Okay",
  "Opt out of these tips.",
  "Seen this before? ",
  "Drop a file to upload it.",
  "Show experimental previews of link content, when available",
  "Show toggle for all embed previews",
  "{count, number} {count, plural, one {Feature} other {Features}} Enabled",
  "If enabled, posts will be formatted to create links, show emoji, style the text, and add line breaks. By default, this setting is enabled. Changing this setting requires the page to be refreshed.",
  "Enable Post Formatting",
  "When \"On\", System Messages saying a user has joined or left a channel will be visible. When \"Off\", the System Messages about joining or leaving a channel will be hidden. A message will still show up when you are added to a channel, so you can receive a notification.",
  "Enable Join/Leave Messages",
  "Show markdown preview option in message input box",
  "Off",
  "On",
  "Check any pre-released features you'd like to preview.  You may also need to refresh the page before the setting will take effect.",
  "Preview pre-release features",
  "If enabled 'ENTER' inserts a new line and 'CTRL + ENTER' submits the message.",
  "Send messages on CTRL + ENTER",
  "Enable external application to offer slash command autocomplete",
  "Advanced Settings",
  "Enable the ability to make and receive one-on-one WebRTC calls",
  "Away Indicator",
  "Button BG",
  "Button Text",
  "Center Channel BG",
  "Center Channel Text",
  "Center Channel Styles",
  "Code Theme",
  "Copy and paste to share theme colors:",
  "Link and Button Styles",
  "Link Color",
  "Mention Jewel BG",
  "Mention Jewel Text",
  "Mention Highlight BG",
  "Mention Highlight Link",
  "New Message Separator",
  "Online Indicator",
  "Sidebar BG",
  "Sidebar Header BG",
  "Sidebar Header Text",
  "Sidebar Text",
  "Sidebar Text Active Border",
  "Sidebar Text Active Color",
  "Sidebar Text Hover BG",
  "Sidebar Styles",
  "Sidebar Unread Text",
  "Channel Display Mode",
  "Select the width of the center channel.",
  "Clock Display",
  "Expand links to show a preview of content, when available.",
  "Link previews",
  "Off",
  "On",
  "Fixed width, centered",
  "Select the font displayed in the Mattermost user interface.",
  "Display Font",
  "Full width",
  "Language",
  "Standard",
  "Easy to scan and read.",
  "Compact",
  "Fit as many messages on the screen as we can.",
  "Select how messages in a channel should be displayed.",
  "Message Display",
  "24-hour clock (example: 16:00)",
  "Set how to display other user's names in posts and the Direct Messages list.",
  "12-hour clock (example: 4:00 PM)",
  "Select how you prefer time displayed.",
  "Show first and last name",
  "Show nickname if one exists, otherwise show first and last name",
  "Show username (default)",
  "Teammate Name Display",
  "Custom Theme",
  "Open to manage your theme",
  "Import theme colors from Slack",
  "See other themes",
  "Theme Colors",
  "Theme",
  "Display Settings",
  "Check your email at {email} to verify the address.",
  "Check your email to verify your new address",
  "Close",
  "Confirm Email",
  "Email",
  "Login occurs through GitLab. Email cannot be updated. Email address used for notifications is {email}.",
  "Login occurs through Google. Email cannot be updated. Email address used for notifications is {email}.",
  "Email is used for sign-in, notifications, and password reset. Email requires verification if changed.",
  "Email has been disabled by your System Administrator. No notification emails will be sent until it is enabled.",
  "Email is used for sign-in, notifications, and password reset.",
  "A verification email was sent to {email}.",
  "Login occurs through AD/LDAP. Email cannot be updated. Email address used for notifications is {email}.",
  "The new emails you entered do not match.",
  "Login occurs through Office 365. Email cannot be updated. Email address used for notifications is {email}.",
  "Login occurs through SAML. Email cannot be updated. Email address used for notifications is {email}.",
  "Your new email address is the same as your old email address.",
  "Click 'Edit' to add your full name",
  "Click 'Edit' to add a nickname",
  "This field is handled through your login provider. If you want to change it, you need to do so through your login provider.",
  "First Name",
  "Full Name",
  "Unable to upload profile image. File is too large.",
  "Image last updated {date}",
  "Last Name",
  "Login done through GitLab ({email})",
  "Login done through Google ({email})",
  "Login done through AD/LDAP ({email})",
  "Login done through Office 365 ({email})",
  "Login done through SAML ({email})",
  "New Address: {email}<br />Check your email to verify the above address.",
  "Nickname",
  "Use Nickname for a name you might be called that is different from your first name and username. This is most often used when two or more people have similar sounding names and usernames.",
  "By default, you will receive mention notifications when someone types your first name. Go to {notify} settings to change this default.",
  "Notifications",
  "Primary Email",
  "Profile Picture",
  "General Settings",
  "Click 'Edit' to upload an image.",
  "Username",
  "Pick something easy for teammates to recognize and recall.",
  "This username is reserved, please choose a new one.",
  "Username must begin with a letter, and contain between {min} to {max} lowercase characters made up of numbers, letters, and the symbols '.', '-', and '_'.",
  "Please enter a valid email address",
  "Only JPG or PNG images may be used for profile pictures",
  "Cancel",
  "To import a theme, go to a Slack team and look for “Preferences -> Sidebar Theme”. Open the custom theme option, copy the theme color values and paste them here:",
  "Import Slack Theme",
  "Submit",
  "Invalid format, please try copying and pasting in again.",
  "Change interface language",
  "Select which language Mattermost displays in the user interface.<br /><br />Would like to help with translations? Join the <a href='http://translate.mattermost.com/' target='_blank'>Mattermost Translation Server</a> to contribute.",
  "Add MFA to your account",
  "You can require a smartphone-based token, in addition to your password, to sign into Mattermost.<br/><br/>To enable, download Google Authenticator from <a target='_blank' href='https://itunes.apple.com/us/app/google-authenticator/id388497605?mt=8'>iTunes</a> or <a target='_blank' href='https://play.google.com/store/apps/details?id=com.google.android.apps.authenticator2&hl=en'>Google Play</a> for your phone, then<br/><br/>1. Click the <strong>Add MFA to your account</strong> button above.<br/>2. Use Google Authenticator to scan the QR code that appears.<br/>3. Type in the Token generated by Google Authenticator and click <strong>Save</strong>.<br/><br/>When logging in, you will be asked to enter a token from Google Authenticator in addition to your regular credentials.",
  "Please scan the bar code with the Google Authenticator app on your smartphone and fill in the token with one provided by the app.",
  "Token (numbers only)",
  "Bar Code",
  "Remove MFA from your account",
  "Removing multi-factor authentication means you will no longer require a phone-based passcode to sign-in to your account.",
  "Multi-factor Authentication",
  "Advanced",
  "Yes, Discard",
  "You have unsaved changes, are you sure you want to discard them?",
  "Discard Changes?",
  "Display",
  "General",
  "Notifications",
  "Security",
  "Account Settings",
  "For all activity",
  "Channel-wide mentions \"@channel\", \"@all\"",
  "Close",
  "Reply notifications",
  "Trigger notifications on messages in reply threads that I start or participate in",
  "In addition to notifications for when you're mentioned, select if you would like to receive notifications on reply threads.",
  "Do not trigger notifications on messages in reply threads unless I'm mentioned",
  "Trigger notifications on messages in threads that I start",
  "Send desktop notifications",
  "For all activity, shown indefinitely",
  "For all activity, shown for {seconds} seconds",
  "For all activity, without sound, shown indefinitely",
  "For all activity, without sound, shown for {seconds} seconds",
  "For all activity, with sound, shown indefinitely",
  "For all activity, with sound, shown for {seconds} seconds",
  "Notification duration",
  "Sets how long desktop notifications will remain on screen.",
  "For mentions and direct messages, shown indefinitely",
  "For mentions and direct messages, shown for {seconds} seconds",
  "For mentions and direct messages, without sound, shown indefinitely",
  "For mentions and direct messages, without sound, shown for {seconds} seconds",
  "For mentions and direct messages, with sound, shown indefinitely",
  "For mentions and direct messages, with sound, shown for {seconds} seconds",
  "{seconds} seconds",
  "Notification sound",
  "Desktop notifications",
  "Unlimited",
  "Desktop notification sounds",
  "Every hour",
  "Every {count, plural, one {minute} other {{count, number} minutes}}",
  "Immediately",
  "Never",
  "Send email notifications",
  "Notifications received over the time period selected are combined and sent in a single email.",
  "Email notifications are sent for mentions and direct messages when you are offline or away from {siteName} for more than 5 minutes.",
  "Email notifications",
  "Notifications",
  "Desktop notifications are available on Firefox, Safari, and Chrome.",
  "Never",
  "No words configured",
  "Off",
  "On",
  "Only for mentions and direct messages",
  "Mobile push notifications",
  "Your case sensitive first name \"{first_name}\"",
  "Your non-case sensitive username \"{username}\"",
  "Other non-case sensitive words, separated by commas:",
  "Please configure notification sounds in your browser settings",
  "Notification sounds are available on IE11, Edge, Safari and Chrome.",
  "Team-wide mentions \"@all\"",
  "Notification Settings",
  "Your username mentioned \"@{username}\"",
  "Words that trigger mentions",
  "For all activity when away or offline",
  "For all activity when offline",
  "For all activity when online, away or offline",
  "Away or offline",
  "Disabled by System Administrator",
  "Push notifications for mobile devices have been disabled by your System Administrator.",
  "Notification alerts are pushed to your mobile device when there is activity in Mattermost.",
  "Off",
  "Offline",
  "Online, away or offline",
  "For mentions and direct messages when away or offline",
  "For mentions and direct messages when offline",
  "For mentions and direct messages when online, away or offline",
  "Send mobile push notifications",
  "Trigger push notifications when",
  "Notification alerts are only pushed to your mobile device when your online status matches the selection above.",
  "Close",
  "Current Password",
  "Please enter your current password.",
  "Deauthorize",
  "Email and Password",
  "GitLab",
  "Google",
  "Last updated {date} at {time}",
  "AD/LDAP",
  "Login done through GitLab",
  "Login done through AD/LDAP",
  "View and Logout of Active Sessions",
  "Sign-in Method",
  "New Password",
  "No OAuth 2.0 Applications are authorized.",
  "OAuth 2.0 Applications",
  "Click 'Edit' to manage your OAuth 2.0 Applications",
  "Applications act on your behalf to access your data based on the permissions you grant them.",
  "Office 365",
  "You may only have one sign-in method at a time. Switching sign-in method will send an email notifying you if the change was successful.",
  "Password",
  "Your password must contain at least {min} characters.",
  "Your password must contain at least {min} characters made up of at least one lowercase letter.",
  "Your password must contain at least {min} characters made up of at least one lowercase letter and at least one number.",
  "Your password must contain at least {min} characters made up of at least one lowercase letter, at least one number, and at least one symbol (e.g. \"~!@#$%^&*()\").",
  "Your password must contain at least {min} characters made up of at least one lowercase letter and at least one symbol (e.g. \"~!@#$%^&*()\").",
  "Your password must contain at least {min} characters made up of at least one lowercase letter and at least one uppercase letter.",
  "Your password must contain at least {min} characters made up of at least one lowercase letter, at least one uppercase letter, and at least one number.",
  "Your password must contain at least {min} characters made up of at least one lowercase letter, at least one uppercase letter, at least one number, and at least one symbol (e.g. \"~!@#$%^&*()\").",
  "Your password must contain at least {min} characters made up of at least one lowercase letter, at least one uppercase letter, and at least one symbol (e.g. \"~!@#$%^&*()\").",
  "Your password must contain at least {min} characters made up of at least one number.",
  "Your password must contain at least {min} characters made up of at least one number and at least one symbol (e.g. \"~!@#$%^&*()\").",
  "Your password must contain at least {min} characters made up of at least one symbol (e.g. \"~!@#$%^&*()\").",
  "Your password must contain at least {min} characters made up of at least one uppercase letter.",
  "Your password must contain at least {min} characters made up of at least one uppercase letter and at least one number.",
  "Your password must contain at least {min} characters made up of at least one uppercase letter, at least one number, and at least one symbol (e.g. \"~!@#$%^&*()\").",
  "Your password must contain at least {min} characters made up of at least one uppercase letter and at least one symbol (e.g. \"~!@#$%^&*()\").",
  "Login occurs through GitLab. Password cannot be updated.",
  "Login occurs through AD/LDAP. Password cannot be updated.",
  "The new passwords you entered do not match.",
  "Invalid minimum length, cannot show preview.",
  "Retype New Password",
  "SAML",
  "Switch to using email and password",
  "Switch to using GitLab SSO",
  "Switch to using Google SSO",
  "Switch to using AD/LDAP",
  "Switch to using Office 365 SSO",
  "Switch to using SAML SSO",
  "Security Settings",
  "View Access History",
  "No users found",
  "Start Video Call",
  "New call unavailable until your existing call ends",
  "Loading ",
  "Download",
  "File {count} of {total}",
  "Get Public Link",
  "About",
  "Help",
  "Privacy",
  "Terms",
  "戻る",
  "All team communication in one place, searchable and accessible anywhere",
  "{username} is busy.",
  "Call",
  "Call with {username} ended.",
  "Cancel call",
  "{username} cancelled the call.",
  "Your call has been declined by {username}.",
  "{username} has WebRTC disabled, and cannot receive calls. To enable the feature, they must go to Account Settings > Advanced > Preview pre-release features and turn on WebRTC.",
  "There was a problem connecting the video call.",
  "Hangup",
  "Call with {username}",
  "You have a call in progress. Please hangup first.",
  "Unable to access camera or microphone.",
  "Mute microphone",
  "{username} is not answering the call.",
  "Answer",
  "Decline",
  "{username} is calling you.",
  "Return to ongoing call with {username}",
  "{username} is offline.",
  "Turn off camera",
  "Unmute microphone",
  "Turn on camera",
  "{username} client does not support video calls.",
  "Video not found"
]
